{"2121280":{"success":true,"data":{"type":"demo","name":"Hostile Takeover Demo","steam_appid":2121280,"required_age":0,"is_free":true,"detailed_description":"Take control of a small team of contractors, hired by mysterious suits for impossible jobs against powerful corporations. Your contractors each have custom cybernetics that allow them to use a host of abilities, represented by cards. These cards are used in turn-based combat for actions such as movement, attacking, defending, and special abilities. Along with combat, you'll also encounter events, character upgrades, and black market shops as you explore each corporation.<br \/>\r\n<br \/>\r\nIt's Called Power, Not Mana<br \/>\r\nPlaying cards costs power, and the bad news is each round your team's power is reset to zero. The good news is that each card not only has a cost, but a gain as well, which can be converted into power when discarded. Do you keep each team member balanced and focus your power on the character with the best draws each round? Or do you turn one of your characters into a recycler to fuel their killing machine companion?<br \/>\r\n<br \/>\r\nUnique Character Classes<br \/>\r\nEach player character is represented by a different class, and each class has their own unique cards to build a deck from. One may rely on shields to reduce <br \/>\r\nincoming damage, while another may instead disappear, forcing enemies to attack another target.<br \/>\r\n<br \/>\r\nCharacter Defining Upgrades<br \/>\r\nAlong with adding new cards to character decks, characters can also be modified through cybernetic upgrades that you occasionally come across. Unlike abilities, these upgrades are always active and can greatly change how a character plays. Discover synergies between upgrades to become even stronger!<br \/>\r\n<br \/>\r\nRandom-ish Levels<br \/>\r\nHand-made environments and encounters are pieced together through procedural generation to build each unique level. Changing layouts, hazards, and events keep each run fresh, while enemy encounters and combat maps are designed for fun and challenge.","about_the_game":"Take control of a small team of contractors, hired by mysterious suits for impossible jobs against powerful corporations. Your contractors each have custom cybernetics that allow them to use a host of abilities, represented by cards. These cards are used in turn-based combat for actions such as movement, attacking, defending, and special abilities. Along with combat, you'll also encounter events, character upgrades, and black market shops as you explore each corporation.<br \/>\r\n<br \/>\r\nIt's Called Power, Not Mana<br \/>\r\nPlaying cards costs power, and the bad news is each round your team's power is reset to zero. The good news is that each card not only has a cost, but a gain as well, which can be converted into power when discarded. Do you keep each team member balanced and focus your power on the character with the best draws each round? Or do you turn one of your characters into a recycler to fuel their killing machine companion?<br \/>\r\n<br \/>\r\nUnique Character Classes<br \/>\r\nEach player character is represented by a different class, and each class has their own unique cards to build a deck from. One may rely on shields to reduce <br \/>\r\nincoming damage, while another may instead disappear, forcing enemies to attack another target.<br \/>\r\n<br \/>\r\nCharacter Defining Upgrades<br \/>\r\nAlong with adding new cards to character decks, characters can also be modified through cybernetic upgrades that you occasionally come across. Unlike abilities, these upgrades are always active and can greatly change how a character plays. Discover synergies between upgrades to become even stronger!<br \/>\r\n<br \/>\r\nRandom-ish Levels<br \/>\r\nHand-made environments and encounters are pieced together through procedural generation to build each unique level. Changing layouts, hazards, and events keep each run fresh, while enemy encounters and combat maps are designed for fun and challenge.","short_description":"A roguelite that combines turn-based tactical combat with deck-building in a cyberpunk setting. Choose your team, build your decks, and install permanent upgrades as you try to bring down powerful corporations.","fullgame":{"appid":"1074740","name":"Hostile Takeover"},"supported_languages":"English","header_image":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2121280\/header.jpg?t=1660595865","website":null,"pc_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> Windows 7, 8, 8.1, 10, 11<br><\/li><li><strong>Processor:<\/strong> 2.0 Ghz<br><\/li><li><strong>Memory:<\/strong> 2 GB RAM<br><\/li><li><strong>Graphics:<\/strong> 256MB Video Memory<br><\/li><li><strong>Storage:<\/strong> 200 MB available space<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> Windows 7, 8, 8.1, 10, 11<br><\/li><li><strong>Processor:<\/strong> 2.0 Ghz<br><\/li><li><strong>Memory:<\/strong> 2 GB RAM<br><\/li><li><strong>Graphics:<\/strong> 256MB Video Memory<br><\/li><li><strong>Storage:<\/strong> 200 MB available space<\/li><\/ul>"},"mac_requirements":[],"linux_requirements":[],"legal_notice":"Whispering Spider Games LLC<br \/>\r\nTERMS OF USE<br \/>\r\nLAST MODIFIED ON July 10, 2019<br \/>\r\n<br \/>\r\nIMPORTANT: PLEASE READ THESE TERMS OF USE CAREFULLY BEFORE CONTINUING TO USE THIS GAME.<br \/>\r\n<br \/>\r\nSECTION 14 OF THIS TERMS OF USE AGREEMENT CONTAINS A BINDING ARBITRATION CLAUSE AND CLASS ACTION WAIVER. IF YOU LIVE IN THE UNITED STATES, THIS SECTION AFFECTS YOUR RIGHTS ABOUT HOW TO RESOLVE DISPUTES THAT YOU MAY HAVE WITH US. PLEASE READ IT CAREFULLY.<br \/>\r\n<br \/>\r\nThis Terms of Use (the “Agreement”) applies to the Whispering Spider game “Hostile Takeover,” (the “Service”), provided by Whispering Spider Games LLC (“Whispering Spider”).<br \/>\r\n<br \/>\r\n      1. Acceptance of Terms<br \/>\r\nBy continuing to use the Service, you agree as follows:<br \/>\r\n<br \/>\r\nYou understand and intend that this Agreement is a legally binding agreement and the equivalent of a signed, written contract;<br \/>\r\nYou will use the Service in a manner consistent with applicable laws and regulations and in accordance with the terms and conditions in this Agreement as it may be amended by Whispering Spider from time to time; and<br \/>\r\nYou understand, accept, and have received this Agreement and its terms and conditions, and acknowledge and demonstrate that you can access this Agreement.<br \/>\r\n<br \/>\r\nIf you do not agree with the terms and conditions in this Agreement, please discontinue all further use of the Service.<br \/>\r\n<br \/>\r\n      2. Whispering Spider’s License to You<br \/>\r\nWhispering Spider grants you a single, non-exclusive, non-transferable and limited personal license to access and use the Service. This license is conditioned on your continued compliance with the terms and conditions in this Agreement. You may not rent, lease, lend, sell, transfer, redistribute, or sublicense the Service and, if you sell or otherwise transfer a device on which any part of the Service is installed to a third party, you must remove the Service from such device before doing so. You may not copy, decompile, reverse-engineer, disassemble, attempt to derive the source code of, modify, or create derivative works of the Service, any updates, or any part thereof (except as and only to the extent that any foregoing restriction is prohibited by applicable law or to the extent as may be permitted by the licensing terms governing use of any open-sourced components included with the Service).<br \/>\r\n<br \/>\r\n      3. Messages from Whispering Spider<br \/>\r\nYou understand that you may receive business-related communications from Whispering Spider through the Service or through email, such as product and other announcements, and administrative notices. You agree that these communications are not “unsolicited commercial email advertisements” and you agree to receive them. Email messages will be accompanied by instructions for opting out.<br \/>\r\n<br \/>\r\n      4. Modification, Termination, and Monitoring of the Service<br \/>\r\nWhispering Spider reserves the right to modify or discontinue, temporarily or permanently, the Service (or any part of the Service) with or without notice at any time. You agree that Whispering Spider will not be liable to you or any third party for any modification, suspension, or discontinuance of the Service.<br \/>\r\n<br \/>\r\nWhispering Spider reserves the right to monitor use of the Service to determine compliance with this Agreement, as well as the right to edit, refuse to post, or remove any Content, information, or materials, in whole or in part, at our sole discretion. We reserve the right to refuse access to the Service to anyone, for any reason, at any time.<br \/>\r\n<br \/>\r\nWhispering Spider may monitor your Content and other communications to evaluate the quality of service you receive, your compliance with the Agreement, the security of the Service, or for other reasons. You agree that such monitoring activities will not entitle you to any cause of action or other right with respect to the manner in which Whispering Spider or its affiliates or agents monitor your Content and other communications and enforces or fails to enforce the terms of the Agreement. In no event will Whispering Spider or any of its affiliates or agents be liable for any costs, damages, expenses, or any other liabilities incurred by you as a result of monitoring activities by Whispering Spider or its affiliates or agents.<br \/>\r\n<br \/>\r\n      5. Security of Data Transmission and Storage<br \/>\r\nElectronic communications using the Service may not always be encrypted. You acknowledge that there is a risk that data, including email, electronic communications, and personal data, may be accessed by unauthorized third parties when communicated between you and Whispering Spider or between you and other parties. <br \/>\r\n<br \/>\r\nWhispering Spider and its affiliates and agents are permitted, but not obligated, to review or retain your Content and other communications. <br \/>\r\n<br \/>\r\n      6. Hyperlinks<br \/>\r\nThe Service may contain links to other sites and software applications, including through display advertisements (the “Linked Services”). Whispering Spider does not control the Linked Services, and Whispering Spider and its affiliates and agents make no representations whatsoever concerning the content, accuracy, security or privacy of those Linked Services. The fact that Whispering Spider has provided a link to an external location is not an endorsement, authorization, sponsorship, or affiliation with respect to such Linked Services, its owners, or its providers. There are risks in using any information, software, or products found on the Internet, and Whispering Spider cautions you to make sure you understand these risks before retrieving, using, relying upon, or purchasing anything via the Internet. You agree that under no circumstances will you hold Whispering Spider or its affiliates or agents liable for any loss or damage caused by use of or reliance on any content, goods, or services available on Linked Services.<br \/>\r\n<br \/>\r\n      7. Trademarks and Copyrights<br \/>\r\nThe Service is owned by Whispering Spider and is protected by United States copyright laws and international treaty provisions. All Service content, trademarks, services marks, trade names, logos, and icons are proprietary to Whispering Spider. Nothing contained in the Service should be construed as granting any license or right to use any trademark displayed in the Service without the written permission of Whispering Spider or such third party that may own the trademarks displayed in the Service. Your use of the trademarks displayed in the Service, or any other content in the Service, except as provided in this Agreement, is strictly prohibited.<br \/>\r\n<br \/>\r\nIntellectual property displayed through the Service is either the property of, or used with permission by, Whispering Spider. You are prohibited from using or authorizing the use of this intellectual property unless specifically permitted under the Agreement. Any unauthorized use of this intellectual property may violate copyright laws, trademark laws, the laws of privacy and publicity, or other regulations and statutes.<br \/>\r\n<br \/>\r\n      8. Disclaimer of Warranties<br \/>\r\nYOUR USE OF THE SERVICE IS ENTIRELY AT YOUR OWN RISK. THE SERVICE IS PROVIDED BY WHISPERING SPIDER ON AN AS-IS BASIS. WHISPERING SPIDER EXPRESSLY DISCLAIMS ALL WARRANTIES OF ANY KIND, WHETHER EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. WHISPERING SPIDER MAKES NO WARRANTY THAT (I) THE SERVICE WILL MEET YOUR REQUIREMENTS, (II) THAT OPERATION OF THE SERVICE WILL BE UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE, OR (III) THE RESULTS THAT MAY BE OBTAINED FROM THE USE OF THE SERVICE WILL BE ACCURATE OR RELIABLE. NO ADVICE OR INFORMATION, WHETHER ORAL OR WRITTEN, OBTAINED BY YOU FROM WHISPERING SPIDER, OR THROUGH THE SERVICE CREATES ANY WARRANTY REGARDING THE SERVICE NOT EXPRESSLY STATED IN THIS AGREEMENT.<br \/>\r\n<br \/>\r\nBecause some states or jurisdictions do not allow the disclaimer of implied warranties, the foregoing disclaimer may not apply to you.<br \/>\r\n<br \/>\r\n      9. Limitation of Liability<br \/>\r\nYOU EXPRESSLY UNDERSTAND AND AGREE THAT WHISPERING SPIDER IS NOT LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL, OR EXEMPLARY DAMAGES, INCLUDING DAMAGES FOR LOSS OF PROFITS, GOODS, GOODWILL, USE, DATA, OR OTHER INTANGIBLE LOSSES (EVEN IF WHISPERING SPIDER HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES), RESULTING FROM THE USE OR THE INABILITY TO USE THE SERVICE OR ANY OTHER MATTER RELATING TO THE SERVICE.<br \/>\r\n<br \/>\r\nBecause some states or jurisdictions do not allow the exclusion or the limitation of liability for consequential or incidental damages, in such states or jurisdictions, the liability of Whispering Spider and its affiliates will be limited to the fullest extent permitted by law.<br \/>\r\n<br \/>\r\n      10. Indemnification<br \/>\r\nYou agree to indemnify and hold Whispering Spider and its affiliates, officers, agents, and employees harmless from any claim, demand, loss, costs, or expense, including attorneys’ fees, made by any person or entity arising out of your violation of this Agreement, state or federal securities laws or regulations, or any other person’s rights, including infringement of any copyright or violation of any proprietary or privacy right. Under no circumstances, including any negligent act, will Whispering Spider or its affiliates or agents be liable for any damages of any kind that result from the use of, or the inability to use, the Service.<br \/>\r\n<br \/>\r\n      11. Your Personal Information<br \/>\r\nPersonal and certain other information is subject to our Privacy Policy. As a condition of using the Service you agree to the terms of the Privacy Policy, as it may be changed from time to time. Our Privacy Policy, which is incorporated here by reference, is located at https:\/\/hostiletakeovergame.com\/privacy-policy. You agree that your use of the Service is subject to the Privacy Policy.<br \/>\r\n<br \/>\r\n      12. Disclosures Required by Law<br \/>\r\nWhispering Spider reserves the right to disclose any information, including personally identifiable information about you, as necessary to satisfy any applicable law, regulation, legal process or governmental request. Whispering Spider reserves the right to fully cooperate with any law enforcement authorities or court order requesting or directing Whispering Spider to disclose the identity of any user believed to be in violation of this Agreement.<br \/>\r\n<br \/>\r\nBy accepting this Agreement, you waive all rights and agree to hold Whispering Spider harmless from any claims resulting from any action taken by Whispering Spider during or as a result of its investigations or from any actions taken as a consequence of investigations by either Whispering Spider or law enforcement authorities.<br \/>\r\n<br \/>\r\n      13. Governing Law; Mediation; Jurisdiction<br \/>\r\nThe Agreement, and all future agreements you enter into with Whispering Spider, unless otherwise indicated on such other agreement, will be governed by the laws of the State of Pennsylvania, without regard to its conflicts of law principles. This is the case regardless of whether you reside or transact business with Whispering Spider, or any of its affiliates or agents, in the State of Pennsylvania or elsewhere. Unless a dispute would be governed by the terms of Section 14 below, you agree to submit to the personal and exclusive jurisdiction of the courts located within the city of Pittsburgh, Pennsylvania, USA.<br \/>\r\n<br \/>\r\nFor EU users only: In the event of a dispute relating to the interpretation, performance, or validity of this Agreement, an amicable solution can be sought before any legal action. You can file your complaint with Whispering Spider by sending a message via email to support@whisperingspidergames.com. In case of failure, you can, within one year of the failed request, have recourse to an Alternative Dispute Resolution procedure by filing an online complaint on the European Commission’s Online Dispute Resolution website: https:\/\/webgate.ec.europa.eu\/odr\/main\/index.cfm?event=main.home.chooseLanguage. In the event that out-of-court dispute resolutions fail, the dispute may be brought before the competent courts.<br \/>\r\n<br \/>\r\n      14. Binding Arbitration<br \/>\r\nArbitration Procedures. Unless you live in the EU, you and Whispering Spider agree that, except as provided in Section 14.4 below, all disputes, controversies, and claims related to this Agreement (each a “Claim”), will be finally and exclusively resolved by binding arbitration, which may be initiated by either party by sending a written notice requesting arbitration to the other party. Any election to arbitrate by one party will be final and binding on the other. The arbitration will be conducted under the Streamlined Arbitration Rules and Procedures of JAMS that are in effect at the time the arbitration is initiated (the “JAMS Rules”) with a single arbitrator and under the terms set forth in this Agreement. In the event of a conflict between the terms set forth in this Binding Arbitration Section and the JAMS Rules, the terms in this Binding Arbitration Section will control and prevail. <br \/>\r\nExcept as otherwise set forth in Section 14.4 below, you may seek any remedies available to you under federal, state, or local laws in an arbitration action. As part of the arbitration, both you and Whispering Spider will have the opportunity for discovery of non-privileged information that is relevant to the Claim. The arbitrator will provide a written statement of the arbitrator’s decision regarding the Claim, the award given and the arbitrator’s findings and conclusions on which the arbitrator’s decision is based. The determination of whether a Claim is subject to arbitration will be governed by the Federal Arbitration Act and determined by a court rather than an arbitrator. Except as otherwise provided in this Agreement, (i) you and Whispering Spider may litigate in court to compel arbitration, stay proceedings pending arbitration, or confirm, modify, vacate or enter judgment on the award entered by the arbitrator; and (ii) the arbitrator’s decision will be final, binding on all parties and enforceable in any court that has jurisdiction, provided that any award may be challenged if the arbitrator fails to follow applicable law. BY AGREEING TO THIS ARBITRATION PROVISION, YOU UNDERSTAND THAT YOU AND WHISPERING SPIDER WAIVE THE RIGHT TO SUE IN COURT AND HAVE A JURY TRIAL.<br \/>\r\nLocation. The arbitration will be conducted in the city of Pittsburgh, Pennsylvania, USA, unless the parties agree to video, phone, or internet connection appearances. <br \/>\r\nLimitations. You and Whispering Spider agree that any arbitration will be limited to the Claim between Whispering Spider and you individually. YOU AND WHISPERING SPIDER AGREE THAT (I) THERE IS NO RIGHT OR AUTHORITY FOR ANY DISPUTE TO BE ARBITRATED ON A CLASS-ACTION BASIS OR TO UTILIZE CLASS ACTION PROCEDURES; (II) THERE IS NO RIGHT OR AUTHORITY FOR ANY DISPUTE TO BE BROUGHT IN A PURPORTED REPRESENTATIVE CAPACITY OR AS A PRIVATE ATTORNEY GENERAL; AND (III) NO ARBITRATION MAY BE JOINED WITH ANY OTHER ARBITRATION.<br \/>\r\nExceptions to Arbitration. You and Whispering Spider agree that the following Claims are not subject to the above provisions concerning negotiations and binding arbitration: (i) any Claim seeking to enforce or protect, or concerning the validity of, any of your or Whispering Spider’s intellectual property rights; (ii) any Claim related to, or arising from, allegations of theft, piracy, invasion of privacy or unauthorized use; and (iii) any claim for equitable relief. In addition to the foregoing, either party may assert an individual action in small claims court for Claims that are within the scope of such court’s jurisdiction in lieu of arbitration.<br \/>\r\nArbitration Fees. If you initiate arbitration for a Claim, you will need to pay the JAMS arbitration initiation fee. If we are initiating arbitration for a Claim, we will pay all costs charged by JAMS for initiating the arbitration. All other fees and costs of the arbitration will be apportioned pursuant to the JAMS Rules. <br \/>\r\nSeverability. You and Whispering Spider agree that if any portion of this Section is found illegal or unenforceable (except any portion of Section 14.4), that portion will be severed and the remainder of the Section shall be given full force and effect. If Section 14.4 is found to be illegal or unenforceable, then neither you nor Whispering Spider will elect to arbitrate any Claim falling within that portion of Section 14.4 found to be illegal or unenforceable and such Claim will be exclusively decided by a court of competent jurisdiction within the city of Pittsburgh, Pennsylvania, USA, and you and Whispering Spider agree to submit to the personal jurisdiction of that court.<br \/>\r\n<br \/>\r\n      15. Miscellaneous Terms<br \/>\r\nAgreement Revisions. This Agreement may only be revised in writing by Whispering Spider, or by Whispering Spider’s publication of a new version on the Service.<br \/>\r\nForce Majeure. Whispering Spider is not liable for any delay or failure to perform resulting from causes outside the reasonable control of Whispering Spider, including without limitation any failure to perform hereunder due to unforeseen circumstances or cause beyond Whispering Spider’s control such as acts of God, war, terrorism, riots, embargoes, acts of civil or military authorities, fire, floods, accidents, strikes, or shortages of transportation facilities, fuel, energy, labor, or materials. <br \/>\r\nNo Partnership. You agree that no joint venture, partnership, employment, or agency relationship exists between you and Whispering Spider as a result of this Agreement or your use of the Service. <br \/>\r\nAssignment. Whispering Spider may assign this Agreement, in whole or in part, to any person or entity at any time with or without your consent. You may not assign the Agreement without Whispering Spider’s prior written consent, and any unauthorized assignment by you will be null and void.<br \/>\r\nSeverability. If any part of this Agreement is determined to be void, invalid or unenforceable, then that portion will be severed, and the remainder of the Agreement will be given full force and effect. <br \/>\r\nAttorneys’ Fees. In the event any litigation is brought by either party in connection with this Agreement, the prevailing party in such litigation will be entitled to recover from the other party all the reasonable costs, attorneys’ fees and other expenses incurred by such prevailing party in the litigation.<br \/>\r\nNo Waiver. Our failure to enforce any provision of this Agreement will in no way be construed to be a present or future waiver of such provision, nor in any way affect the right of any party to enforce every such provision thereafter. The express waiver by us of any provision, condition or requirement of this Agreement will not constitute a waiver of any future obligation to comply with such provision, condition or requirement. <br \/>\r\nEquitable Remedies. You hereby agree that Whispering Spider would be irreparably damaged if the terms of this Agreement were not specifically enforced, and therefore you agree that we will be entitled, without bond, other security, or proof of damages, to appropriate equitable remedies with respect to breaches of this Agreement, in addition to such other remedies as we may otherwise have available to us under applicable laws.<br \/>\r\nEntire Agreement. This Agreement, including the documents expressly incorporated by reference, constitutes the entire agreement between you and Whispering Spider with respect to the Service and supersedes all prior or contemporaneous communications, whether electronic, oral or written, between you and Whispering Spider with respect to the Service.","developers":["Whispering Spider Games"],"publishers":["Whispering Spider Games"],"package_groups":[],"platforms":{"windows":true,"mac":false,"linux":false},"categories":[{"id":2,"description":"Single-player"},{"id":10,"description":"Game demo"}],"release_date":{"coming_soon":false,"date":"15 Aug, 2022"},"support_info":{"url":"","email":"support@whisperingspidergames.com"},"background":"","background_raw":"","content_descriptors":{"ids":[],"notes":null}}}}