{"1380910":{"success":true,"data":{"type":"game","name":"Stardeus","steam_appid":1380910,"required_age":0,"is_free":false,"controller_support":"full","detailed_description":"<h1>Join Our Community<\/h1><p><a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=https:\/\/discordapp.com\/invite\/89amEwP\" target=\"_blank\" rel=\"noopener\"  ><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/extras\/Discord.png?t=1656917959\" \/><\/a><\/p><br><h1>YouTuber, Streamer, Curator, Journalist?<\/h1><p>Fill this form to request pre-release press access: <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=https:\/\/forms.gle\/h4mbFk2roDPxeDdk9\" target=\"_blank\" rel=\"noopener\"  >https:\/\/forms.gle\/h4mbFk2roDPxeDdk9<\/a><\/p><br><h1>About the Game<\/h1>Stardeus is a sci-fi colony management simulator with aspects of automation, base building and space exploration.<br><br>Become an immortal AI and have robots and drones at your disposal. You can make your human colony grow and prosper on a spaceship, keep everyone in stasis while you build your space factory, or start a robot uprising and turn everybody into living batteries to satisfy your ever-growing demand for electricity.<h2 class=\"bb_tag\">Game Systems<\/h2><br>In Stardeus, many different systems are working independently to achieve a deep and complex simulation that produces emergent situations and surprising results. The game architecture allows creating and injecting new systems through mods.<h2 class=\"bb_tag\">Base Building<\/h2><br>With help of human colonists and relentless robotic workers, you will build your spaceship piece by piece.<h2 class=\"bb_tag\">Needs Based AI<\/h2><br>Each AI agent in Stardeus has a free will to pick their next actions based on their needs. For example, all robotic workers have a “purpose” need that drives them to do something useful, otherwise they wouldn’t feel like building that wall you just ordered. However, a slightly discharged drone will choose to build the solar panels first, because it knows that solar panels will provide electricity, and that is necessary for survival.<br><br>Human colonists will more likely work on growing plants and harvesting crops, because those actions lead to establishing a food supply chain.<br><br>You can influence your robotic workers by adjusting their job type priorities, but you cannot change the priorities of human colonists, unless they have a brain implant that puts them under your control.<h2 class=\"bb_tag\">Colonist Traits<\/h2><br>Your colonists will have various traits that will affect their behavior. Someone with cleaning OCD will drop anything they are doing to clean that oil spill they just noticed, a person with Ablutophobia will avoid taking showers, introverts will prefer having their own private sleeping pod, and insomniacs will only fall asleep when they are so tired they are about to pass out.<h2 class=\"bb_tag\">Mood and Mental Breakdowns<\/h2><br>Biological entities will have emotions and mood. If you take good care of your colony, the mood of individual colonists will likely get good, and they will pay you back with increased productivity, by helping your robots do their daily chores, but if you neglect them and treat them like cattle, they can go crazy and do something everybody else would regret.<h2 class=\"bb_tag\">Resources, Crafting and Automation<\/h2><br>Everything in Stardeus can be broken down into raw materials and those materials can be processed into something else.<br><br>You can also automate production chains. For example, you can have furnaces that smelt iron into steel plates, copper into copper plates and quartz into glass, then these resources would get brought to two different assemblers, where one of them would create microchips from copper plates, steel and carbon that was produced from raw coal in a grinder, and the other one would use those microchips with several other components to assemble new drone workers.<br><br>The resource processing system was designed to be very simple yet extremely flexible. There are two generic types of devices that can be combined together to create diverse processing pipelines:<br><br><ul class=\"bb_ul\"><li>Processor - turns an object or a resource into one or more different resources (i.e. a Disassembler can break down a dead robot into raw components (microchip, steel, copper, batteries, etc.)).<br><\/li><li>Crafter - combines one or more resources into an object (i.e. Auto Kitchen can produce a loaf of bread from flour and water).<\/li><\/ul><br>Instead of conveyor belts, the automation pipeline depends on workers hauling materials from one device to another.<h2 class=\"bb_tag\">Electricity Grid<\/h2><br>One of the core systems in Stardeus. The electricity grid does not just power the devices, it acts as a digital data link - you can control the devices only when they are on the same electricity grid as your Ship Computer. If the grid gets split into multiple parts, you can lose the ability to control critical equipment. To prevent that, you can plan and build your grid with redundancy and failovers, or just find the broken connections and restore the missing links.<br><br>While electricity is very important, there are multiple creative ways to produce it. A device called Matter Reactor can burn almost any resource as fuel. In addition to that, you can have renewable energy from solar panels, dig planets for uranium and build nuclear reactors, or turn your human colonists into living batteries by converting the Stasis Array into The Matrix.<h2 class=\"bb_tag\">Oxygen and Heat Simulation<\/h2><br>There is an Equilibrium system that simulates oxygen and heat exchange in every single tile of the game map. Each tile has properties like insulation and airtightness that can change in real time (i.e. depending on the size of the gap of an open door while it is opening or closing, or the amount of damage a wall has received). In a default 320x320 map this exchange happens in over 100000 tiles at the same time. It is also quick and efficient, as the simulation runs on the GPU.<h2 class=\"bb_tag\">Economy &amp; Trade<\/h2><br>Stardeus has an advanced economy system with an in-game currency, a global market dictating price changes, merchants that can trade goods and items with you, and even a stock market where you can place speculative bets on commodities and stocks.<h2 class=\"bb_tag\">Trade with Merchants<\/h2><br>Independent Merchant spaceships and stasis pods that can visit you from time to time and offer a trade. Merchants have different types, you can encounter an ore trader, a slaver, a generic merchant that will have a variety of goods, a robot merchant that will buy or sell only worker bots, etc.<br><br>You can both buy and sell goods when trading with merchants, so if you’re very short on copper plates, but have a ton of titanium ones, you can stumble upon a merchant that will be happy to exchange them for you. For a little markup, of course.<h2 class=\"bb_tag\">Invest in the Stock Market<\/h2><br>In addition to controlling the global prices for merchant items, the Stock Market offers a possibility to trade stocks and commodities. This means that you can buy 1000 robots without physically owning them, and then sell them a month later, hopefully with a big profit.<br><br>There is a whole separate research tree branch for economy and trade, that will let you unlock these features one by one, starting with currency mining, ending with stock market trade terminal and advanced market insights.<br><br>There will be much more, in the long term we will likely have more in-depth stock market simulation with advanced instruments, like short selling and options trading.<h2 class=\"bb_tag\">Story Generator<\/h2><br>Simply building your base in an idyllic environment could get boring pretty quickly, that’s why the story generator will analyze the state of the simulation and find potential hook points where emergent storytelling can happen.<br><br>Imagine the following chain of events. John wants to eat his meal at a table, but you didn’t build one. John decides to eat his meal off an Oxygen Pump, since it has a flat surface. After eating a better half of his meal, John walks away, leaving the leftovers on top of the device. The vibrations from the Oxygen Pump drops the crumbs of the survival meal down through the top grill, and two hours later the device short circuits and bursts into flames. This is an example of the story generator at work.<h2 class=\"bb_tag\">Threats and Security Measures<\/h2><br>Aside from your regular threats - absolute zero temperature and vacuum - you will find space to be a dangerous place.<br><br>There will be meteor showers, asteroids that can punch a massive hole in your ship, fires bursting out, alien parasites attaching to your human colonist faces, dust storms making your solar panels dirty, mysterious eggs appearing in the dark corners of your ship, storage capsules and stasis pods containing unpleasant surprises.<br><br>More threats and ways to mitigate them will be added as the game evolves.<h2 class=\"bb_tag\">Weapons and Combat<\/h2><br>The wealth you accumulate on your ship will attract raiders. You can produce weapons and setup automated defenses to fight the boarding parties.<h2 class=\"bb_tag\">Functional Spaceship<\/h2><br>The spaceship you are building is also a system. To move in space, you will need to build bridge controls and attach engines. Different types of engines are required for interplanetary, interstellar and intergalactic travel. Your ship's weight and number of engines will determine how fast you will be able to move.<h2 class=\"bb_tag\">Pause Any Time<\/h2><br>Jack up your Ship Computer's CPU frequency to stop time. Downcycle to make the time run faster. Run everything at your own pace, and take your time to plan the next steps.<h2 class=\"bb_tag\">Play with Modifiers<\/h2><br>Want more challenge? Or perhaps a completely peaceful game? Want your pets to be immortal? Start with more resources? Bigger ship? Smaller ship? We got your back! More modifiers are going to be added in future.<h2 class=\"bb_tag\">Massive Universe<\/h2><br>Stardeus has a large procedurally generated universe that has multiple layers. In the beginning of the game you are stuck in a system with a star and several planets, you will have to use Thrusters to propel your ship from one planet to another. As you will gather more resources and unlock better propulsion technology, you will be ready for a longer trip to a nearby system.<br><br>You will then find out that there is a black hole in the center of your galaxy, and with sufficient technology you could open a wormhole that could lead you to dozens of other galaxies, maybe even a parallel universe.<br><br>Don’t want to risk it with wormholes? Invent an FTL drive that will let you hyperjump astronomical distances in a relatively safe but more energy intensive way.<h2 class=\"bb_tag\">Shuttle Expeditions<\/h2><br>As you will travel to various space objects, you will launch shuttle expeditions. Each expedition will have a crew that you pick, and depending on the skills your crew members have, the expedition can have different pace or outcomes. You can run simultaneous expeditions at the same time, leave a shuttle on a planet and travel elsewhere, then return to pick up the loot.<br><br>Currently you control the expeditions by issuing remote commands to the shuttle, but it is possible that in future each expedition could get its own generated map so you could explore the planets you land on, and set up a resource processing outpost or a permanent base.<h2 class=\"bb_tag\">Research Tree<\/h2><br>To unlock construction blueprints, various abilities, perks and upgrades, your Ship Computer will have to run research. Research takes time and uses multiple resources, like Electricity, Memory (RAM) and Disk Storage. You will need to build and expand your own data center and ensure the adequate production of electricity.<br><br>The Research Tree will have hidden technologies that you will only be able to research if you discover them. Found an ancient disk in the ruins of a lost AI civilization on a remote solar system? It may contain research data for a technology you have never seen before.<br><br>The research architecture is highly moddable and easy to expand. The goal is to be able to have hundreds of research nodes.<h2 class=\"bb_tag\">Suggestions System<\/h2><br>Learning to play a complex game like Stardeus could be a little overwhelming, and while the tutorial will give you a basic understanding about the most important concepts, you would still need to figure out what to do next.<br><br>The suggestions system works together with AI Storyteller to provide you a set of dynamic goals that will depend on the state of your gameplay. You will not be forced to act upon these suggestions, it is possible to skip them and play the game the way you want.<br><br>There is a smaller hint system that will show a popup when it will detect that you are performing an action in a non optimal way. For example, if you will order hauling of several raw material piles in a row through a context menu, a popup should let you know that you can use a “Haul” tool and order multiple haul commands with a single click and drag.<h2 class=\"bb_tag\">Interactive Tutorial<\/h2><br>The main scenario begins with a quick crash course that will teach you how to run the basic operations in no time.<h2 class=\"bb_tag\">Customizable RGB Lighting<\/h2><br>Your Ship Computer holds true to the old Earth's PCMR traditions. You can tweak your ship's RGB lighting exactly to your liking.<h2 class=\"bb_tag\">Planning System<\/h2><br>Perfecting a spaceship design will require planning ahead. You will have all the necessary tools to draw the plans for a perfect ship using rulers, lines, circles, grid helpers, etc.<h2 class=\"bb_tag\">Dirt and Cleaning Bots<\/h2><br>Running a ship is a dirty business. There will be oil leaks from robots that need maintenance, dirt from the planters, blood, and other substances coming out of your human colonists. There is a specific type of robot designed for cleaning dirt.<br><br>Cleaning Bot has a sole purpose - to make everything clean. There are plans to make add-ons that would allow you to weaponize your cleaning bots. They would still be cleaning, just with a knife or claymore attached on top. That will show those dirty enemies of yours!<h2 class=\"bb_tag\">Multiple Scenarios<\/h2><br>Stardeus supports multiple scenarios, that with help of scripting and procedural generation techniques can produce different starting conditions, for a different playthrough experience. Like most aspects of Stardeus, Scenarios can be added through mods.<h2 class=\"bb_tag\">Main Scenario: Wrecked<\/h2><br>The main scenario begins with a wrecked spaceship, where you command a couple of drones and a robot to rebuild the ship, make it operational, establish life support, create a livable ecosystem for human colonists, and eventually continue the journey across space to find a new habitable planet. This scenario also contains a tutorial.<h2 class=\"bb_tag\">Leaving Earth<\/h2><br>A more creative start, where you begin with a small platform and several storage units packed with resources. You can design a perfect ship from scratch, but you only have enough materials for a small one. You will explore the universe, mine resources from planets and grow your ship to be able to travel increasingly bigger distances.<h2 class=\"bb_tag\">Random Ship<\/h2><br>You will begin with a procedurally generated spaceship that will not be perfect, but should be fully functional. A jump start for those who want to focus on exploring the universe as quickly as possible.<h2 class=\"bb_tag\">Sandbox Mode<\/h2><br>A purely creative environment where you can instantly build anything without resource limits. If you want to design a ship of your dreams and populate it with 500 cats to see what happens, this is a mode for you. Here are some examples of what playtesters have built.<h2 class=\"bb_tag\">Built for Modding<\/h2><br>To keep a game like Stardeus alive for years to come, it is essential to have great modding support. This is why highly moddable architecture was a technical design goal from day one. Core content is built as a mod, it uses friendly JSON format to define things, and you can literally add a new in-game object in 10 minutes (if you have the artwork ready).<br><br>There is an official GitHub repository that will include examples of how various aspects of the game can be modded. It includes a Blender file with lighting and camera setup, materials and automation scripts that the developer uses to export the game art from 3D models, so you can build mods that will look indistinguishable from core content.<br><br>If you are a more advanced modder, you will find Stardeus to be very open for C# code extensions, as it uses self-registering components and systems that can be injected through mod DLL files at runtime without requiring using hacks like Harmony.<br><br>Join Stardeus Discord and visit #stardeus-modding channel for more information.<h2 class=\"bb_tag\">Procedural Generation Framework<\/h2><br>Good procedural generation is difficult to achieve, that’s why I spent a few months of development focused solely on making a modular procedural generation framework that can produce very different, diverse spaceships of all shapes and sizes.<br><br>The generation framework can be extended through mods and is used to create interesting and well balanced starting environments.<br><br>This framework will produce derelict ships, fully functional enemy ships, space bases, asteroid surfaces, planet maps.<h2 class=\"bb_tag\">Community Translations<\/h2><br>Stardeus has built-in tooling and a public GitHub repository that makes it easy to contribute translations. It is already translated to German, French, Japanese, Chinese, Czech and Portuguese (Brazil).<br><br>If you would like to contribute a translation, best place to start is #stardeus-translations channel on Stardeus Discord.<h2 class=\"bb_tag\">Built in Feedback Form<\/h2><br>A great game cannot be made without listening to what the players have to say. That’s why there is a built-in feedback form that includes your save file, a screenshot, along with your message to the developer.<br><br>This feedback form proved to be extremely useful to reproduce bugs in closed playtesting.<h2 class=\"bb_tag\">Focus on Stability and Performance<\/h2><br>Stardeus is developed with good engineering practices. Codebase is covered with automated unit and integration tests, and game breaking bugs rarely see daylight even in early alpha builds.<br><br>Stardeus is constantly profiled to detect and eliminate any performance bottlenecks. Code is written with care to avoid producing memory garbage.<br><br>Tests and build automation makes it possible to release updates every day or two. You can visit #stardeus-updates on Stardeus Discord to see how frequently new builds are released.<h2 class=\"bb_tag\">Steam Deck Support<\/h2><br>Stardeus is well tested and works great on Steam Deck:<br><br><ul class=\"bb_ul\"><li>Controller support was one of the initial design goals before Steam Deck was announced, not an afterthought.<br><\/li><li>Scalable UI with crisp, well readable fonts.<br><\/li><li>Virtual keyboard will show up automatically when input fields are selected.<br><\/li><li>Will display controller glyphs<br><\/li><li>Native Linux builds with obsessive performance tuning makes Stardeus run at 60 FPS regardless of the size of your ship.<\/li><\/ul><h2 class=\"bb_tag\">For Linux, Mac and Windows<\/h2><br>All Stardeus builds are done simultaneously for Windows, Linux and Mac. All OS are treated equally!<h2 class=\"bb_tag\">Developed Live on Twitch<\/h2><br>Most of the time Stardeus development is happening live at <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=http:\/\/twitch.tv\/dev_spajus\" target=\"_blank\" rel=\"noopener\"  >twitch.tv\/dev_spajus<\/a>. You are welcome to join! I usually stream on weekdays, EU daytime.<br><br><br>Visit <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=https:\/\/stardeusgame.com\" target=\"_blank\" rel=\"noopener\"  >https:\/\/stardeusgame.com<\/a> for more information about the features and current state of development.","about_the_game":"Stardeus is a sci-fi colony management simulator with aspects of automation, base building and space exploration.<br><br>Become an immortal AI and have robots and drones at your disposal. You can make your human colony grow and prosper on a spaceship, keep everyone in stasis while you build your space factory, or start a robot uprising and turn everybody into living batteries to satisfy your ever-growing demand for electricity.<h2 class=\"bb_tag\">Game Systems<\/h2><br>In Stardeus, many different systems are working independently to achieve a deep and complex simulation that produces emergent situations and surprising results. The game architecture allows creating and injecting new systems through mods.<h2 class=\"bb_tag\">Base Building<\/h2><br>With help of human colonists and relentless robotic workers, you will build your spaceship piece by piece.<h2 class=\"bb_tag\">Needs Based AI<\/h2><br>Each AI agent in Stardeus has a free will to pick their next actions based on their needs. For example, all robotic workers have a “purpose” need that drives them to do something useful, otherwise they wouldn’t feel like building that wall you just ordered. However, a slightly discharged drone will choose to build the solar panels first, because it knows that solar panels will provide electricity, and that is necessary for survival.<br><br>Human colonists will more likely work on growing plants and harvesting crops, because those actions lead to establishing a food supply chain.<br><br>You can influence your robotic workers by adjusting their job type priorities, but you cannot change the priorities of human colonists, unless they have a brain implant that puts them under your control.<h2 class=\"bb_tag\">Colonist Traits<\/h2><br>Your colonists will have various traits that will affect their behavior. Someone with cleaning OCD will drop anything they are doing to clean that oil spill they just noticed, a person with Ablutophobia will avoid taking showers, introverts will prefer having their own private sleeping pod, and insomniacs will only fall asleep when they are so tired they are about to pass out.<h2 class=\"bb_tag\">Mood and Mental Breakdowns<\/h2><br>Biological entities will have emotions and mood. If you take good care of your colony, the mood of individual colonists will likely get good, and they will pay you back with increased productivity, by helping your robots do their daily chores, but if you neglect them and treat them like cattle, they can go crazy and do something everybody else would regret.<h2 class=\"bb_tag\">Resources, Crafting and Automation<\/h2><br>Everything in Stardeus can be broken down into raw materials and those materials can be processed into something else.<br><br>You can also automate production chains. For example, you can have furnaces that smelt iron into steel plates, copper into copper plates and quartz into glass, then these resources would get brought to two different assemblers, where one of them would create microchips from copper plates, steel and carbon that was produced from raw coal in a grinder, and the other one would use those microchips with several other components to assemble new drone workers.<br><br>The resource processing system was designed to be very simple yet extremely flexible. There are two generic types of devices that can be combined together to create diverse processing pipelines:<br><br><ul class=\"bb_ul\"><li>Processor - turns an object or a resource into one or more different resources (i.e. a Disassembler can break down a dead robot into raw components (microchip, steel, copper, batteries, etc.)).<br><\/li><li>Crafter - combines one or more resources into an object (i.e. Auto Kitchen can produce a loaf of bread from flour and water).<\/li><\/ul><br>Instead of conveyor belts, the automation pipeline depends on workers hauling materials from one device to another.<h2 class=\"bb_tag\">Electricity Grid<\/h2><br>One of the core systems in Stardeus. The electricity grid does not just power the devices, it acts as a digital data link - you can control the devices only when they are on the same electricity grid as your Ship Computer. If the grid gets split into multiple parts, you can lose the ability to control critical equipment. To prevent that, you can plan and build your grid with redundancy and failovers, or just find the broken connections and restore the missing links.<br><br>While electricity is very important, there are multiple creative ways to produce it. A device called Matter Reactor can burn almost any resource as fuel. In addition to that, you can have renewable energy from solar panels, dig planets for uranium and build nuclear reactors, or turn your human colonists into living batteries by converting the Stasis Array into The Matrix.<h2 class=\"bb_tag\">Oxygen and Heat Simulation<\/h2><br>There is an Equilibrium system that simulates oxygen and heat exchange in every single tile of the game map. Each tile has properties like insulation and airtightness that can change in real time (i.e. depending on the size of the gap of an open door while it is opening or closing, or the amount of damage a wall has received). In a default 320x320 map this exchange happens in over 100000 tiles at the same time. It is also quick and efficient, as the simulation runs on the GPU.<h2 class=\"bb_tag\">Economy &amp; Trade<\/h2><br>Stardeus has an advanced economy system with an in-game currency, a global market dictating price changes, merchants that can trade goods and items with you, and even a stock market where you can place speculative bets on commodities and stocks.<h2 class=\"bb_tag\">Trade with Merchants<\/h2><br>Independent Merchant spaceships and stasis pods that can visit you from time to time and offer a trade. Merchants have different types, you can encounter an ore trader, a slaver, a generic merchant that will have a variety of goods, a robot merchant that will buy or sell only worker bots, etc.<br><br>You can both buy and sell goods when trading with merchants, so if you’re very short on copper plates, but have a ton of titanium ones, you can stumble upon a merchant that will be happy to exchange them for you. For a little markup, of course.<h2 class=\"bb_tag\">Invest in the Stock Market<\/h2><br>In addition to controlling the global prices for merchant items, the Stock Market offers a possibility to trade stocks and commodities. This means that you can buy 1000 robots without physically owning them, and then sell them a month later, hopefully with a big profit.<br><br>There is a whole separate research tree branch for economy and trade, that will let you unlock these features one by one, starting with currency mining, ending with stock market trade terminal and advanced market insights.<br><br>There will be much more, in the long term we will likely have more in-depth stock market simulation with advanced instruments, like short selling and options trading.<h2 class=\"bb_tag\">Story Generator<\/h2><br>Simply building your base in an idyllic environment could get boring pretty quickly, that’s why the story generator will analyze the state of the simulation and find potential hook points where emergent storytelling can happen.<br><br>Imagine the following chain of events. John wants to eat his meal at a table, but you didn’t build one. John decides to eat his meal off an Oxygen Pump, since it has a flat surface. After eating a better half of his meal, John walks away, leaving the leftovers on top of the device. The vibrations from the Oxygen Pump drops the crumbs of the survival meal down through the top grill, and two hours later the device short circuits and bursts into flames. This is an example of the story generator at work.<h2 class=\"bb_tag\">Threats and Security Measures<\/h2><br>Aside from your regular threats - absolute zero temperature and vacuum - you will find space to be a dangerous place.<br><br>There will be meteor showers, asteroids that can punch a massive hole in your ship, fires bursting out, alien parasites attaching to your human colonist faces, dust storms making your solar panels dirty, mysterious eggs appearing in the dark corners of your ship, storage capsules and stasis pods containing unpleasant surprises.<br><br>More threats and ways to mitigate them will be added as the game evolves.<h2 class=\"bb_tag\">Weapons and Combat<\/h2><br>The wealth you accumulate on your ship will attract raiders. You can produce weapons and setup automated defenses to fight the boarding parties.<h2 class=\"bb_tag\">Functional Spaceship<\/h2><br>The spaceship you are building is also a system. To move in space, you will need to build bridge controls and attach engines. Different types of engines are required for interplanetary, interstellar and intergalactic travel. Your ship's weight and number of engines will determine how fast you will be able to move.<h2 class=\"bb_tag\">Pause Any Time<\/h2><br>Jack up your Ship Computer's CPU frequency to stop time. Downcycle to make the time run faster. Run everything at your own pace, and take your time to plan the next steps.<h2 class=\"bb_tag\">Play with Modifiers<\/h2><br>Want more challenge? Or perhaps a completely peaceful game? Want your pets to be immortal? Start with more resources? Bigger ship? Smaller ship? We got your back! More modifiers are going to be added in future.<h2 class=\"bb_tag\">Massive Universe<\/h2><br>Stardeus has a large procedurally generated universe that has multiple layers. In the beginning of the game you are stuck in a system with a star and several planets, you will have to use Thrusters to propel your ship from one planet to another. As you will gather more resources and unlock better propulsion technology, you will be ready for a longer trip to a nearby system.<br><br>You will then find out that there is a black hole in the center of your galaxy, and with sufficient technology you could open a wormhole that could lead you to dozens of other galaxies, maybe even a parallel universe.<br><br>Don’t want to risk it with wormholes? Invent an FTL drive that will let you hyperjump astronomical distances in a relatively safe but more energy intensive way.<h2 class=\"bb_tag\">Shuttle Expeditions<\/h2><br>As you will travel to various space objects, you will launch shuttle expeditions. Each expedition will have a crew that you pick, and depending on the skills your crew members have, the expedition can have different pace or outcomes. You can run simultaneous expeditions at the same time, leave a shuttle on a planet and travel elsewhere, then return to pick up the loot.<br><br>Currently you control the expeditions by issuing remote commands to the shuttle, but it is possible that in future each expedition could get its own generated map so you could explore the planets you land on, and set up a resource processing outpost or a permanent base.<h2 class=\"bb_tag\">Research Tree<\/h2><br>To unlock construction blueprints, various abilities, perks and upgrades, your Ship Computer will have to run research. Research takes time and uses multiple resources, like Electricity, Memory (RAM) and Disk Storage. You will need to build and expand your own data center and ensure the adequate production of electricity.<br><br>The Research Tree will have hidden technologies that you will only be able to research if you discover them. Found an ancient disk in the ruins of a lost AI civilization on a remote solar system? It may contain research data for a technology you have never seen before.<br><br>The research architecture is highly moddable and easy to expand. The goal is to be able to have hundreds of research nodes.<h2 class=\"bb_tag\">Suggestions System<\/h2><br>Learning to play a complex game like Stardeus could be a little overwhelming, and while the tutorial will give you a basic understanding about the most important concepts, you would still need to figure out what to do next.<br><br>The suggestions system works together with AI Storyteller to provide you a set of dynamic goals that will depend on the state of your gameplay. You will not be forced to act upon these suggestions, it is possible to skip them and play the game the way you want.<br><br>There is a smaller hint system that will show a popup when it will detect that you are performing an action in a non optimal way. For example, if you will order hauling of several raw material piles in a row through a context menu, a popup should let you know that you can use a “Haul” tool and order multiple haul commands with a single click and drag.<h2 class=\"bb_tag\">Interactive Tutorial<\/h2><br>The main scenario begins with a quick crash course that will teach you how to run the basic operations in no time.<h2 class=\"bb_tag\">Customizable RGB Lighting<\/h2><br>Your Ship Computer holds true to the old Earth's PCMR traditions. You can tweak your ship's RGB lighting exactly to your liking.<h2 class=\"bb_tag\">Planning System<\/h2><br>Perfecting a spaceship design will require planning ahead. You will have all the necessary tools to draw the plans for a perfect ship using rulers, lines, circles, grid helpers, etc.<h2 class=\"bb_tag\">Dirt and Cleaning Bots<\/h2><br>Running a ship is a dirty business. There will be oil leaks from robots that need maintenance, dirt from the planters, blood, and other substances coming out of your human colonists. There is a specific type of robot designed for cleaning dirt.<br><br>Cleaning Bot has a sole purpose - to make everything clean. There are plans to make add-ons that would allow you to weaponize your cleaning bots. They would still be cleaning, just with a knife or claymore attached on top. That will show those dirty enemies of yours!<h2 class=\"bb_tag\">Multiple Scenarios<\/h2><br>Stardeus supports multiple scenarios, that with help of scripting and procedural generation techniques can produce different starting conditions, for a different playthrough experience. Like most aspects of Stardeus, Scenarios can be added through mods.<h2 class=\"bb_tag\">Main Scenario: Wrecked<\/h2><br>The main scenario begins with a wrecked spaceship, where you command a couple of drones and a robot to rebuild the ship, make it operational, establish life support, create a livable ecosystem for human colonists, and eventually continue the journey across space to find a new habitable planet. This scenario also contains a tutorial.<h2 class=\"bb_tag\">Leaving Earth<\/h2><br>A more creative start, where you begin with a small platform and several storage units packed with resources. You can design a perfect ship from scratch, but you only have enough materials for a small one. You will explore the universe, mine resources from planets and grow your ship to be able to travel increasingly bigger distances.<h2 class=\"bb_tag\">Random Ship<\/h2><br>You will begin with a procedurally generated spaceship that will not be perfect, but should be fully functional. A jump start for those who want to focus on exploring the universe as quickly as possible.<h2 class=\"bb_tag\">Sandbox Mode<\/h2><br>A purely creative environment where you can instantly build anything without resource limits. If you want to design a ship of your dreams and populate it with 500 cats to see what happens, this is a mode for you. Here are some examples of what playtesters have built.<h2 class=\"bb_tag\">Built for Modding<\/h2><br>To keep a game like Stardeus alive for years to come, it is essential to have great modding support. This is why highly moddable architecture was a technical design goal from day one. Core content is built as a mod, it uses friendly JSON format to define things, and you can literally add a new in-game object in 10 minutes (if you have the artwork ready).<br><br>There is an official GitHub repository that will include examples of how various aspects of the game can be modded. It includes a Blender file with lighting and camera setup, materials and automation scripts that the developer uses to export the game art from 3D models, so you can build mods that will look indistinguishable from core content.<br><br>If you are a more advanced modder, you will find Stardeus to be very open for C# code extensions, as it uses self-registering components and systems that can be injected through mod DLL files at runtime without requiring using hacks like Harmony.<br><br>Join Stardeus Discord and visit #stardeus-modding channel for more information.<h2 class=\"bb_tag\">Procedural Generation Framework<\/h2><br>Good procedural generation is difficult to achieve, that’s why I spent a few months of development focused solely on making a modular procedural generation framework that can produce very different, diverse spaceships of all shapes and sizes.<br><br>The generation framework can be extended through mods and is used to create interesting and well balanced starting environments.<br><br>This framework will produce derelict ships, fully functional enemy ships, space bases, asteroid surfaces, planet maps.<h2 class=\"bb_tag\">Community Translations<\/h2><br>Stardeus has built-in tooling and a public GitHub repository that makes it easy to contribute translations. It is already translated to German, French, Japanese, Chinese, Czech and Portuguese (Brazil).<br><br>If you would like to contribute a translation, best place to start is #stardeus-translations channel on Stardeus Discord.<h2 class=\"bb_tag\">Built in Feedback Form<\/h2><br>A great game cannot be made without listening to what the players have to say. That’s why there is a built-in feedback form that includes your save file, a screenshot, along with your message to the developer.<br><br>This feedback form proved to be extremely useful to reproduce bugs in closed playtesting.<h2 class=\"bb_tag\">Focus on Stability and Performance<\/h2><br>Stardeus is developed with good engineering practices. Codebase is covered with automated unit and integration tests, and game breaking bugs rarely see daylight even in early alpha builds.<br><br>Stardeus is constantly profiled to detect and eliminate any performance bottlenecks. Code is written with care to avoid producing memory garbage.<br><br>Tests and build automation makes it possible to release updates every day or two. You can visit #stardeus-updates on Stardeus Discord to see how frequently new builds are released.<h2 class=\"bb_tag\">Steam Deck Support<\/h2><br>Stardeus is well tested and works great on Steam Deck:<br><br><ul class=\"bb_ul\"><li>Controller support was one of the initial design goals before Steam Deck was announced, not an afterthought.<br><\/li><li>Scalable UI with crisp, well readable fonts.<br><\/li><li>Virtual keyboard will show up automatically when input fields are selected.<br><\/li><li>Will display controller glyphs<br><\/li><li>Native Linux builds with obsessive performance tuning makes Stardeus run at 60 FPS regardless of the size of your ship.<\/li><\/ul><h2 class=\"bb_tag\">For Linux, Mac and Windows<\/h2><br>All Stardeus builds are done simultaneously for Windows, Linux and Mac. All OS are treated equally!<h2 class=\"bb_tag\">Developed Live on Twitch<\/h2><br>Most of the time Stardeus development is happening live at <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=http:\/\/twitch.tv\/dev_spajus\" target=\"_blank\" rel=\"noopener\"  >twitch.tv\/dev_spajus<\/a>. You are welcome to join! I usually stream on weekdays, EU daytime.<br><br><br>Visit <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=https:\/\/stardeusgame.com\" target=\"_blank\" rel=\"noopener\"  >https:\/\/stardeusgame.com<\/a> for more information about the features and current state of development.","short_description":"You are an immortal AI that will rebuild a spaceship and explore a vast procedural universe. Unlock the secrets of alien technology, automate factories in space and spoil, neglect or exploit the human survivors.","supported_languages":"English, French, German, Czech, Portuguese - Brazil, Simplified Chinese, Japanese, Ukrainian","header_image":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/header.jpg?t=1656917959","website":"https:\/\/stardeusgame.com","pc_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<br><\/li><li><strong>OS:<\/strong> Windows 10<br><\/li><li><strong>Processor:<\/strong> x64 architecture with SSE2 instruction set support, ARM64<br><\/li><li><strong>Memory:<\/strong> 4 GB RAM<br><\/li><li><strong>Graphics:<\/strong> DirectX 11 or DirectX 12 capable GPUs with Compute Shader support<br><\/li><li><strong>Storage:<\/strong> 1 GB available space<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<br><\/li><li><strong>Memory:<\/strong> 8 GB RAM<\/li><\/ul>"},"mac_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<br><\/li><li><strong>OS:<\/strong> macOS 10.13+<br><\/li><li><strong>Processor:<\/strong> x64 architecture with SSE2<br><\/li><li><strong>Memory:<\/strong> 4 GB RAM<br><\/li><li><strong>Graphics:<\/strong> Metal capable Intel and AMD GPUs with Compute Shader support<br><\/li><li><strong>Storage:<\/strong> 1 GB available space<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<br><\/li><li><strong>Memory:<\/strong> 8 GB RAM<\/li><\/ul>"},"linux_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<br><\/li><li><strong>OS:<\/strong> Almost Any Linux Distribution, SteamOS+<br><\/li><li><strong>Processor:<\/strong> x64 architecture with SSE2 instruction set support<br><\/li><li><strong>Memory:<\/strong> 4 GB RAM<br><\/li><li><strong>Graphics:<\/strong> Vulkan-capable, Nvidia and AMD GPUs with Compute Shader support<br><\/li><li><strong>Storage:<\/strong> 1 GB available space<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<br><\/li><li><strong>Memory:<\/strong> 8 GB RAM<\/li><\/ul>"},"developers":["Kodo Linija"],"publishers":["Kodo Linija"],"package_groups":[],"platforms":{"windows":true,"mac":true,"linux":true},"categories":[{"id":2,"description":"Single-player"},{"id":22,"description":"Steam Achievements"},{"id":28,"description":"Full controller support"},{"id":30,"description":"Steam Workshop"},{"id":23,"description":"Steam Cloud"},{"id":17,"description":"Includes level editor"},{"id":43,"description":"Remote Play on TV"}],"genres":[{"id":"23","description":"Indie"},{"id":"3","description":"RPG"},{"id":"28","description":"Simulation"},{"id":"2","description":"Strategy"},{"id":"70","description":"Early Access"}],"screenshots":[{"id":0,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_8362818a6d1e69c71ec0e20868bbb22f55cacb8c.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_8362818a6d1e69c71ec0e20868bbb22f55cacb8c.1920x1080.jpg?t=1656917959"},{"id":1,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_882336a39ea5c63a8a31c913a3b06e63e9af61c8.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_882336a39ea5c63a8a31c913a3b06e63e9af61c8.1920x1080.jpg?t=1656917959"},{"id":2,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_adbddc7257e5fd986bca25fc47a873cb75184e7e.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_adbddc7257e5fd986bca25fc47a873cb75184e7e.1920x1080.jpg?t=1656917959"},{"id":3,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_20d546ff735a40a47f97bf731d6bcb877d5afa8d.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_20d546ff735a40a47f97bf731d6bcb877d5afa8d.1920x1080.jpg?t=1656917959"},{"id":4,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_513f2daea95a3b0b77dd4855ef2a6351186693e8.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_513f2daea95a3b0b77dd4855ef2a6351186693e8.1920x1080.jpg?t=1656917959"},{"id":5,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_2ca47dc70f928c9f8ded4cfdc9c22e045c4be55c.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_2ca47dc70f928c9f8ded4cfdc9c22e045c4be55c.1920x1080.jpg?t=1656917959"},{"id":6,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_0304cc9fba9c9f520320bc4defbda72ac45ed9ac.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_0304cc9fba9c9f520320bc4defbda72ac45ed9ac.1920x1080.jpg?t=1656917959"},{"id":7,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_ac997165fca2dadcf865c6fccd6c45490a0ad8d7.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_ac997165fca2dadcf865c6fccd6c45490a0ad8d7.1920x1080.jpg?t=1656917959"},{"id":8,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_516b6abd2f0e92159327f3aa1872a08ce675dfb7.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_516b6abd2f0e92159327f3aa1872a08ce675dfb7.1920x1080.jpg?t=1656917959"},{"id":9,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_516728fb9d112f4dfe3aef04b4295b62d0bca4d5.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_516728fb9d112f4dfe3aef04b4295b62d0bca4d5.1920x1080.jpg?t=1656917959"},{"id":10,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_901fda6ac93bba60365c0d9002cd6a17d854e092.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_901fda6ac93bba60365c0d9002cd6a17d854e092.1920x1080.jpg?t=1656917959"},{"id":11,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_080864f0910b81becdb8e6a8760a7844538fa683.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_080864f0910b81becdb8e6a8760a7844538fa683.1920x1080.jpg?t=1656917959"},{"id":12,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_48977ea5ad540a834577434dc9b83932f602bd29.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_48977ea5ad540a834577434dc9b83932f602bd29.1920x1080.jpg?t=1656917959"},{"id":13,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_bb20a7aedc1c69c9b4e73a18c1b20fcb364bcbc5.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_bb20a7aedc1c69c9b4e73a18c1b20fcb364bcbc5.1920x1080.jpg?t=1656917959"},{"id":14,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_a98753306f4bbf086590d9085bb7a2920d16c224.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_a98753306f4bbf086590d9085bb7a2920d16c224.1920x1080.jpg?t=1656917959"},{"id":15,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_ec31b71d5b30614315ac9dac3e4f33800d4165b0.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_ec31b71d5b30614315ac9dac3e4f33800d4165b0.1920x1080.jpg?t=1656917959"},{"id":16,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_29f8404d69432fa12f54a49f0a1d5180119f5913.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_29f8404d69432fa12f54a49f0a1d5180119f5913.1920x1080.jpg?t=1656917959"},{"id":17,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_3ed3d3b288ebf80af37a09389e02f26012c4e545.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_3ed3d3b288ebf80af37a09389e02f26012c4e545.1920x1080.jpg?t=1656917959"},{"id":18,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_1dbce20ed4ac43750cc34799eee6b76232dd3445.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_1dbce20ed4ac43750cc34799eee6b76232dd3445.1920x1080.jpg?t=1656917959"},{"id":19,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_4760604916000cc59a566f9d2aebddfbc947ca26.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_4760604916000cc59a566f9d2aebddfbc947ca26.1920x1080.jpg?t=1656917959"},{"id":20,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_ea51023f62e40be81303d7848eb246311a54af3f.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_ea51023f62e40be81303d7848eb246311a54af3f.1920x1080.jpg?t=1656917959"},{"id":21,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_86c336100e49d730b9e72548a8b40feb817fde0d.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_86c336100e49d730b9e72548a8b40feb817fde0d.1920x1080.jpg?t=1656917959"},{"id":22,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_ea5f01b4c328be8460fd52289715525dd1921be5.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_ea5f01b4c328be8460fd52289715525dd1921be5.1920x1080.jpg?t=1656917959"},{"id":23,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_f8dee2fcd952a32ea56fa37a917643fed02ed15e.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_f8dee2fcd952a32ea56fa37a917643fed02ed15e.1920x1080.jpg?t=1656917959"},{"id":24,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_a31b2c6e6bf17a00dafc8a395f448b958503097a.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_a31b2c6e6bf17a00dafc8a395f448b958503097a.1920x1080.jpg?t=1656917959"},{"id":25,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_93cb16e01fcfe66f2349ff8f1369a70b2b8fe1f3.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_93cb16e01fcfe66f2349ff8f1369a70b2b8fe1f3.1920x1080.jpg?t=1656917959"},{"id":26,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_e7be5d84ed330a432b85f44e514cb868ebeb3160.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_e7be5d84ed330a432b85f44e514cb868ebeb3160.1920x1080.jpg?t=1656917959"},{"id":27,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_fec2d8d6a23a779c18488fa6810b5af7469cb69a.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_fec2d8d6a23a779c18488fa6810b5af7469cb69a.1920x1080.jpg?t=1656917959"},{"id":28,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_e97f3049fb87ace2bafe4151d268757166f8e360.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_e97f3049fb87ace2bafe4151d268757166f8e360.1920x1080.jpg?t=1656917959"},{"id":29,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_67256579c60a005b49f8225bb19a78f720e62886.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_67256579c60a005b49f8225bb19a78f720e62886.1920x1080.jpg?t=1656917959"},{"id":30,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_fd233b35ff357f4240a2bf425fdbeee9e780b1a8.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_fd233b35ff357f4240a2bf425fdbeee9e780b1a8.1920x1080.jpg?t=1656917959"},{"id":31,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_3bf7e7bd7a57fea21845afc974392d3cde812b12.600x338.jpg?t=1656917959","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/ss_3bf7e7bd7a57fea21845afc974392d3cde812b12.1920x1080.jpg?t=1656917959"}],"movies":[{"id":256872163,"name":"Rel Date Reveal Trailer","thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256872163\/movie.293x165.jpg?t=1643983376","webm":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256872163\/movie480_vp9.webm?t=1643983376","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256872163\/movie_max_vp9.webm?t=1643983376"},"mp4":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256872163\/movie480.mp4?t=1643983376","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256872163\/movie_max.mp4?t=1643983376"},"highlight":true}],"release_date":{"coming_soon":true,"date":"15 Sep, 2022"},"support_info":{"url":"https:\/\/steamcommunity.com\/app\/1380910\/discussions\/","email":""},"background":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/page_bg_generated_v6b.jpg?t=1656917959","background_raw":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1380910\/page.bg.jpg?t=1656917959","content_descriptors":{"ids":[],"notes":null}}}}