{"1188420":{"success":true,"data":{"type":"game","name":"The Lost Throne 失落的王座","steam_appid":1188420,"required_age":0,"is_free":true,"detailed_description":"<h1>Join our Community!<\/h1><p>Sorry for keeping everyone waiting for this long! Finally, our community test is now available! Please join our official QQ group Steam community , then ask the admin for keys.<br><strong>Official QQ Group<\/strong>: 909384372 The Lost Throne ｜Outpost<br><strong>Official Bilibili<\/strong> <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=https:\/\/space.bilibili.com\/524927662\" target=\"_blank\" rel=\"noopener\"  >https:\/\/space.bilibili.com\/524927662<\/a><\/p><br><h1>About the Game<\/h1><h2 class=\"bb_tag\">What is this game about?<\/h2>&quot;The Lost Throne&quot; is a trading card game with great world settings. There are various featured mechanics and designs, like unique battle phase after several turns, cost deductions, front and back formations, etc. Besides, we will be developing other modes like tournament system, single PVE, co-op PVE, special PVP and so on.<h2 class=\"bb_tag\">Why TCG?<\/h2>This is one of the most frequently asked questions, why choosing TCG as our first game? Although this genre has many predecessors and verified features to learn from: deck building, card trading, different strategies. However, it is still challenging to produce good card designs, balancing and trading models.<br><br>Our team is young, and this is our first game. Our team is consist of experienced TCG players and well-known pro players. We aim to provide a solid game with our past experiences for TCG players, while letting other players feel the attractiveness of TCG.<h2 class=\"bb_tag\">Concepts of Designs<\/h2>Gameplay is definitely the key of our design. We aim to produce a highly original competitive game with unique player experience. Therefore we devoted many thoughts into the game.<br>Thoughts on Interaction: How to avoid long waiting time for each turn.<br>Thoughts on turn-based game: How to balance going first and second.<br>Thoughts on card designs: How to make troops more &quot;heroic&quot;, rather than expendables.<br><br>Our main focus is all about &quot;strategies&quot;, including deck building, unit deployment, battle phase plans. For each phase, players' strategies will be colliding with each other, which is our main idea for the game. It is also what makes &quot;The Lost Throne&quot; unique.<h2 class=\"bb_tag\">What we've been doing in past two years?<\/h2>We paid much price for the &quot;setback&quot; in 2020. But we also gained many experiences. Therefore our team has entered &quot;Saiyan Mode&quot; this year. We redo the UI, improved game performances, porting to mobile, and make the alpha version of tutorials.<br>In other words, what didn't kill us made us stronger. We are now march at full scale!<h2 class=\"bb_tag\">About our future plans<\/h2>We have launched our alpha test for mobile version. After the 2 weeks test, we knew two things: Accepetable gameplay, but too many bugs.<br>Although there is still much to improve for our gameplay, players are still satisfied with our current designs, which is really cheering for us. Thank you for you tolerance and support! There are still many bugs existing, which require many adjustment to our underlying system. Therefore we really need some time to fix them. Also our designers have been discussing and rethinking about the details and possible improvements to our battle phases.<br><br>Overall, our future plan includes the improvement to our entire Battle phase, Tutorial refurnishment, PVE alpha version, Tournament systems, and so on. Also we will keep improving the balancing for the current version, while designing the second version. Of course, we will be posting our updates as dev blogs here and looking forward to your feedbacks and suggestions! Please follow us for more information.<br>Besides, we are planning to launch another community test at a smaller scale. Please feel free to join our steam community and we will be releasing more details within the community and QQ group.","about_the_game":"<h2 class=\"bb_tag\">What is this game about?<\/h2>&quot;The Lost Throne&quot; is a trading card game with great world settings. There are various featured mechanics and designs, like unique battle phase after several turns, cost deductions, front and back formations, etc. Besides, we will be developing other modes like tournament system, single PVE, co-op PVE, special PVP and so on.<h2 class=\"bb_tag\">Why TCG?<\/h2>This is one of the most frequently asked questions, why choosing TCG as our first game? Although this genre has many predecessors and verified features to learn from: deck building, card trading, different strategies. However, it is still challenging to produce good card designs, balancing and trading models.<br><br>Our team is young, and this is our first game. Our team is consist of experienced TCG players and well-known pro players. We aim to provide a solid game with our past experiences for TCG players, while letting other players feel the attractiveness of TCG.<h2 class=\"bb_tag\">Concepts of Designs<\/h2>Gameplay is definitely the key of our design. We aim to produce a highly original competitive game with unique player experience. Therefore we devoted many thoughts into the game.<br>Thoughts on Interaction: How to avoid long waiting time for each turn.<br>Thoughts on turn-based game: How to balance going first and second.<br>Thoughts on card designs: How to make troops more &quot;heroic&quot;, rather than expendables.<br><br>Our main focus is all about &quot;strategies&quot;, including deck building, unit deployment, battle phase plans. For each phase, players' strategies will be colliding with each other, which is our main idea for the game. It is also what makes &quot;The Lost Throne&quot; unique.<h2 class=\"bb_tag\">What we've been doing in past two years?<\/h2>We paid much price for the &quot;setback&quot; in 2020. But we also gained many experiences. Therefore our team has entered &quot;Saiyan Mode&quot; this year. We redo the UI, improved game performances, porting to mobile, and make the alpha version of tutorials.<br>In other words, what didn't kill us made us stronger. We are now march at full scale!<h2 class=\"bb_tag\">About our future plans<\/h2>We have launched our alpha test for mobile version. After the 2 weeks test, we knew two things: Accepetable gameplay, but too many bugs.<br>Although there is still much to improve for our gameplay, players are still satisfied with our current designs, which is really cheering for us. Thank you for you tolerance and support! There are still many bugs existing, which require many adjustment to our underlying system. Therefore we really need some time to fix them. Also our designers have been discussing and rethinking about the details and possible improvements to our battle phases.<br><br>Overall, our future plan includes the improvement to our entire Battle phase, Tutorial refurnishment, PVE alpha version, Tournament systems, and so on. Also we will keep improving the balancing for the current version, while designing the second version. Of course, we will be posting our updates as dev blogs here and looking forward to your feedbacks and suggestions! Please follow us for more information.<br>Besides, we are planning to launch another community test at a smaller scale. Please feel free to join our steam community and we will be releasing more details within the community and QQ group.","short_description":"&quot;The Lost Throne&quot; is a trading card game with great world settings. We will be developing other modes like tournament system, single PVE, co-op PVE, special PVP and so on.","supported_languages":"Simplified Chinese<strong>*<\/strong>, English<br><strong>*<\/strong>languages with full audio support","header_image":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/header.jpg?t=1650649265","website":null,"pc_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> 需要 64 位处理器和操作系统<br><\/li><li><strong>Processor:<\/strong> Intel i5, 2.4 Ghz or better<br><\/li><li><strong>Memory:<\/strong> 4 GB RAM<br><\/li><li><strong>Graphics:<\/strong> Integrated HD Graphics 520 w\/128 MB or better<br><\/li><li><strong>DirectX:<\/strong> Version 11<br><\/li><li><strong>Network:<\/strong> Broadband Internet connection<br><\/li><li><strong>Storage:<\/strong> 7 GB available space<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> 需要 64 位处理器和操作系统<br><\/li><li><strong>Processor:<\/strong> Intel i5, 2.4 Ghz or better<br><\/li><li><strong>Memory:<\/strong> 4 GB RAM<br><\/li><li><strong>Graphics:<\/strong> Integrated HD Graphics 520 w\/128 MB or better<br><\/li><li><strong>DirectX:<\/strong> Version 11<br><\/li><li><strong>Network:<\/strong> Broadband Internet connection<br><\/li><li><strong>Storage:<\/strong> 7 GB available space<\/li><\/ul>"},"mac_requirements":[],"linux_requirements":[],"legal_notice":"The Lost Throne Account 失落的王座用户协议<br \/>\r\n<br \/>\r\n本协议系失落的王座向用户提供相关产品和服务时与用户达成的关于使用失落的王座产品和服务的各项规则、条款和条件，以下称“本协议”。<br \/>\r\n在您使用失落的王座提供的产品和服务前，请您务必审慎阅读、充分理解本协议各条款内容以及失落的王座公布的各项服务规则（包括但不限于网络游戏防沉迷规则及实名认证规则等），特别是免除或者减轻我们责任、个人信息保护、账号和权益、未成年人保护、法律管辖等可能和您有重大利害关系的条款。<br \/>\r\n未成年人用户在使用失落的王座提供的产品和服务前，需要在父母或者其他监护人的陪同下阅读本协议。我们鼓励未成年人的父母或其他监护人共同阅读本协议，指导未成年人使用本产品和服务。<br \/>\r\n您通过网络页面点击同意本协议和\/或实际使用本产品和服务的行为将视为您已阅读、理解并同意接受本协议。如果您对本协议有任何的疑问、投诉、意见和建议，欢迎您通过本协议所附联系方式与我们沟通反馈，我们十分乐意为您解答。 <br \/>\r\n<br \/>\r\n1.概述 <br \/>\r\n1.1“用户”指被授权使用失落的王座产品和服务，以及愿意接受或实际上已经接受失落的王座提供的产品和服务的个人，以下或简称为“您”。<br \/>\r\n1.2本协议是用户接受失落的王座产品和服务时适用的通用条款。因此，请您在注册成为失落的王座用户前或接受失落的王座的产品和服务之前，详细地阅读本协议的所有内容。 <br \/>\r\n1.3随着经营情况的变化，失落的王座有权更改本协议及失落的王座各产品和服务的相关服务规则。修改本协议及各服务规则时，失落的王座将于失落的王座网站相关页面和服务的页面更新修改后的用户协议及各服务规则。若用户不同意本协议或相关服务规则，或者不同意失落的王座做出的修改，用户可以主动停止使用失落的王座提供的产品和服务。如果在失落的王座修改协议或服务规则后，用户仍继续使用失落的王座提供的产品和服务，即表示用户同意失落的王座对本协议及相关服务规则所做的修改。<br \/>\r\n<br \/>\r\n2.知识产权和所有权声明 <br \/>\r\n2.1失落的王座拥有其所提供的与产品和服务有关的全部内容，包括但不限于美术、音乐、软件代码、信息、资料、技术等的著作权、专利权、商标权、其他知识产权、所有权或其他权利（包括财产权利和精神权利），或者已获得相关权利人的授权。除非事先获得失落的王座或相关权利人的合法授权，用户不得对任何内容，包括但不限于美术、音乐、软件代码、技术信息、资料等进行修改、抄袭、复制、传播、传送、展示、发行、授权、制作衍生作品、或销售，法律法规允许合理使用（如为个人学习、研究或者欣赏）的除外。如用户未遵守本条款的上述规定，在法律所允许的最大限度内，且在不损害其他相关方权利的情况下，失落的王座可立即终止向用户提供产品和服务，用户必须销毁任何已经获得的上述服务或产品内容。<br \/>\r\n2.2失落的王座对用户在使用失落的王座产品过程中或用户在接受失落的王座的服务过程中所产生的任何数据信息（包括但不限于账号资料、游戏数据及系统衍生数据等）拥有所有权。用户通过其合法账号及密码正常登录失落的王座特定产品后，该产品的游戏程序向用户显示的数据和信息为用户就该特定产品所有权获取的全部数据和信息。用户仅有权依据本协议及有关游戏规则在该款产品中使用该等数据和信息。失落的王座无义务向用户提供、展示超出用户自行登录使用产品便可获取的数据和信息以外的数据和信息。<br \/>\r\n在失落的王座提供的服务中游戏账号下权益全部归失落的王座所有。在法律所允许的最大限度内，失落的王座有权决定保留或不保留失落的王座存储的全部或部分游戏账号下权益。<br \/>\r\n失落的王座产品和服务中的各种游戏账号下的权益，包括但不限于等级、元宝、钻石等游戏币\/券、道具(含装备)等，是失落的王座所提供的服务的一部分，其所有权归属失落的王座。用户只能在合乎法律规定和游戏规则的情况下使用，且可通过游戏行为和充值行为获准使用游戏账号下的权益。本协议所称用户对“游戏道具的交换\/转让”均指游戏道具使用权的交换\/转让，用户无权交换\/转让游戏道具的所有权。<br \/>\r\n用户知悉并同意：用户向其拥有使用权的失落的王座相关产品和服务的账号内充值兑换获取游戏道具时，失落的王座可能会同时赠与一定比例的游戏道具，用户在使用及消耗游戏道具时，如充值兑换游戏道具与获赠的游戏道具不可区分，充值兑换的游戏道具将视为优先于失落的王座赠予的游戏道具被使用与消耗；如充值兑换的游戏道具与获赠的游戏道具可以区分，则按照实际使用及消耗量计算。<br \/>\r\n<br \/>\r\n3.资费政策<br \/>\r\n3.1失落的王座在提供产品和服务时，可能会对部分产品和服务向用户收取一定的费用。在此情况下，失落的王座会在相关页面上做明确的提示。如用户拒绝支付该等费用，则不能使用相关的产品和服务。 <br \/>\r\n对于失落的王座的收费产品和服务，用户应该按照失落的王座所公布的资费政策购买；否则，失落的王座可以拒绝或立即停止向用户提供该产品和服务。 <br \/>\r\n3.2失落的王座将根据游戏运营情况，对所提供的产品和服务的资费标准和收费方式（包括免费到收费的修改）进行适当调整。失落的王座可能会就不同的产品和服务制定不同的资费标准和收费方式，也可能按照所提供的产品和服务的不同阶段确定不同的资费标准和收费方式。失落的王座会将有关产品和服务的资费标准、收费方式、购买方式或其他有关资费政策的信息放置在该产品和服务的官方网站或者相关页面的显著位置。如果资费标准或收费方式发生变化，用户没有停止使用失落的王座的产品或服务，则视为用户接受调整的资费标准和收费方式。如您不同意我们新的资费标准或收费方式，我们亦会在新的资费标准或收费方式发布后留有一定的时间让您处理您账号下的服务内容。<br \/>\r\n3.3为了保障用户的合法权益以及完整地使用失落的王座的产品和服务的权利，用户应通过失落的王座游戏、失落的王座官方合作伙伴等失落的王座认可的途径购买失落的王座的产品和服务。失落的王座及其官方合作伙伴依据其届时有效的服务规则处理相关纠纷。用户因通过非失落的王座认可的途径购买前述失落的王座产品和服务遭受损失的，由用户自行承担责任。<br \/>\r\n<br \/>\r\n4.账号和密码 <br \/>\r\n4.1用户承诺以其真实身份注册失落的王座账号，并保证所提供的个人身份资料信息真实、完整、有效，依据法律规定和本协议约定对所提供的信息承担相应的法律责任。失落的王座有权审查用户注册所提供的身份信息是否真实、有效，并应积极地采取技术与管理等合理措施保障用户账号的安全、有效。用户有义务妥善保管其账号及密码，并正确、安全地使用其账号及密码。用户未尽上述义务导致账号密码遗失、账号被盗等情形而给自身造成损害的，由用户自己承担由此产生的直接和间接损失。包括但不限于失落的王座因技术障碍或失窃用户未充分举证证明账号密码遗失、被盗是他人故意行为，导致失落的王座无法或不予找回失窃账号给用户造成的损失失落的王座找回了失窃账号但不保证账号内的全部物品安全而导致的损失失窃账号内的物品经过一次或多次流转被其他用户合法获得，无法找回而导致的损失等。<br \/>\r\n4.2用户申请注册成功后，失落的王座有权根据失落的王座各产品商业运营情况分配给用户账号。账号一旦设定就不可再为变更。每注册一个即一次合同缔约行为，成就一份独立的服务合同。但失落的王座有权就同一用户名下的不同账号进行单独或整体的管理。<br \/>\r\n4.3用户在注册时应提供完整、详尽、真实的个人资料，若所提供的资料日后有变更，用户应及时登录账号进行更新及修改。用户以其真实身份注册后，需要修改所提供的个人身份资料信息或账号密码的，失落的王座应当按照本协议及失落的王座相关服务规则及时、有效地为用户提供该项服务。若用户向失落的王座提供的个人资料与事实不符，失落的王座有权停止向其继续提供产品和服务。当用户向失落的王座主张其拥有某账号使用权时，若该账号在失落的王座的身份信息记录与用户的身份信息有任何不符，失落的王座有权不予认定该账号使用权为该用户所有。<br \/>\r\n4.4在无充足相反证据证明的情况下，用户账号使用权属于注册人。在没有经过失落的王座允许并登记的情况下，用户不得对账号使用权进行买卖、赠与、交换、继承或任何其它形式的交易。用户不得将账号、密码、账号的身份信息等泄漏或提供给他人知悉，也不得将账号出借或转让给他人使用。如因用户自身过错或用户计算机感染病毒或木马，而导致账号或密码泄漏的，用户应自行承担由此造成的损失。失落的王座（包括但不限于失落的王座的网站和论坛管理人员、客服人员等）不会以任何方式询问用户的密码，所以用户不应对任何人泄漏用户的密码，不要多人共享同一个账号，不要安装非法或来路不明的程序。如果用户遗失了密码，失落的王座针对处理此问题之服务保留索取额外费用的权利。<br \/>\r\n4.5若用户发现账号或密码被他人非法使用或有异常使用的情形，应立即根据失落的王座公布的处理方式通知失落的王座，并有权通知失落的王座暂停该账号的登录和使用，但用户在申请时应履行必要的手续，诸如提供与其注册身份信息相一致的个人有效身份信息。失落的王座核实用户所提供的个人有效身份信息与所注册的身份信息相一致的，应当按照本协议及失落的王座的相关服务规则等及时采取措施暂停用户账号的登录和使用。失落的王座违反上述约定，未及时采取措施暂停用户账号的登录和使用，因此而给用户造成损失的，应当承担其相应的法律责任，但失落的王座对采取行动之前用户账号已执行的指令不承担责任。用户没有提供其个人有效身份证件或者用户提供的个人有效身份证件与所注册的身份信息不一致的，失落的王座有权拒绝用户上述请求。 <br \/>\r\n4.6失落的王座在服务器数据出现异常（包括程序Bug导致的数据异常）时，有权将该服务器的数据还原到一定时点，对因此可能导致的用户账号内游戏道具等发生减损的情形，失落的王座可根据损失情况对用户提供一定的游戏道具补偿，用户认同此种数据还原方式和补偿方式。<br \/>\r\n<br \/>\r\n5.用户的权利 <br \/>\r\n5.1用户可以根据本协议以及失落的王座公布的服务规则等来接受失落的王座提供的产品和服务。用户有权在接受失落的王座提供的产品和服务的期间监督失落的王座及失落的王座的工作人员是否按照失落的王座所公布的标准向用户提供产品和服务，也可以随时向失落的王座提出与失落的王座的产品和服务有关意见和建议。<br \/>\r\n5.2用户在拥有合法使用权的账号下，可以在失落的王座的服务器上传使用服务所必需的信息，但信息中不得含有如下内容：<br \/>\r\n5.2.1侵犯任何第三者的知识产权或其他权益的内容；<br \/>\r\n5.2.2违反任何法律或善良风俗的内容；<br \/>\r\n5.2.3包含任何毁谤他人，性骚扰，种族歧视，或对未成年人有不良影响的内容；<br \/>\r\n5.2.4包含病毒、木马程序、定时炸弹等可能对失落的王座或任何人的计算机系统造成伤害或影响其稳定性的内容。<br \/>\r\n如果用户上传信息违反上述规定，失落的王座有权依照上传信息的严重性采取必要的处理措施，包括但不限于根据第三方提出的权利主张屏蔽或删除用户上传的信息。<br \/>\r\n5.3用户特此授权失落的王座在为用户提供服务以及对失落的王座的产品和服务进行介绍、宣传、推广等活动中免费使用用户上传的内容。<br \/>\r\n5.4如果用户不同意本协议或相关服务规则，不接受失落的王座对本协议或服务规则不时做出的修改，用户可以随时停止使用失落的王座的产品和服务。如果用户选择停止使用失落的王座的产品和服务，则视为用户放弃其账号及账号内相应的游戏道具使用权等，失落的王座对用户不承担任何义务和责任。<br \/>\r\n<br \/>\r\n6.用户的义务 <br \/>\r\n6.1用户需自行配备注册和使用失落的王座产品和服务所需的各项计算机及网络设备以及网络资源，并自行负担上网所需的各项费用。<br \/>\r\n6.2失落的王座向用户提供的产品和服务本身属于商业行为，用户需要支付相应的费用。 <br \/>\r\n6.3用户有义务妥善保管使用账号及服务有关的身份信息和证件。用户对登录后所持账号产生的行为依法享有权利和承担责任，使用该账号的人即被视为用户本人，其做出的任何行为也将视为用户的行为，用户应当为此账号使用者的一切行为负责。用户知悉并同意，失落的王座有权根据用户充值消费的金额的不同对用户提供相应的服务。<br \/>\r\n失落的王座有权根据服务的重要性不同，制定不同的安全级别策略，并要求用户提供相应级别的身份验证信息及资料。当某项服务的申请者按失落的王座既定的方式通过身份验证后，失落的王座即可视其为该账号用户并依其申请提供服务，由此产生的一切后果由拥有该账号使用权的用户自行承担。<br \/>\r\n6.4用户在使用失落的王座产品和接受失落的王座服务的过程中，用户：<br \/>\r\n6.4.1不得为任何非法目的而使用服务系统；<br \/>\r\n6.4.2不得对包括但不仅限于失落的王座网站及提供的软件进行修改，还原工程(Reverse Engineering)，译码(Decompile)，反向组译(Disassemble)、复制(Copy)或散布(Distribute) ，包括但不限于修改本软件所使用的任何专有通讯协议、对动态随机存取内存（RAM）中资料进行修改或锁定；<br \/>\r\n6.4.3不得采取任何可能影响失落的王座服务的非正常使用行为（包括但不限于损害、攻击服务器或使服务器过度负荷等）；<br \/>\r\n6.4.4不得使用任何外挂程序或游戏修改程序；<br \/>\r\n外挂程序是指独立于游戏软件之外的，能够在游戏运行的同时影响游戏操作的所有程序，包括但不限于模拟用户操作、改变操作环境、修改数据等一切类型。（如国家有关法律、法规及政府主管部门的规章或规范性文件规定的外挂定义与本协议有冲突，则以法律、法规、部门规章或规范性文件规定的为准。<br \/>\r\n6.4.5不得通过未经失落的王座认可的第三方软件或在第三方软件的辅助下使用失落的王座的产品或接受失落的王座的服务；<br \/>\r\n6.4.6不得采取任何破坏游戏规则和违反游戏公平性的行为；<br \/>\r\n为避免破坏游戏的公平性或平衡性，用户同意并理解其只能通过失落的王座提供的产品和服务进行正常的娱乐互动，以及基于该等娱乐互动的需要于失落的王座提供或认可的交易平台上交易游戏道具。除上述情形之外的游戏道具交易或其他任何牟利情形将被视为牟取不正当利益，包括但不限于用户：<br \/>\r\n(1)注册多个用户账号和\/或游戏角色ID，以盈利为目的的进行游戏行为，使用失落的王座产品和服务；<br \/>\r\n(2)从事失落的王座游戏内单一或系列产出玩法，将获得的游戏道具出售获利；<br \/>\r\n(3)利用不同服务器的游戏道具价值差异，在不同服务器买卖游戏道具获利；<br \/>\r\n(4)充当游戏账号、游戏道具交易中介收取费用获利；<br \/>\r\n(5)在非失落的王座提供或认可的交易平台上交易用户账号或游戏道具获利；<br \/>\r\n(6)将失落的王座游戏内获得的游戏道具用于出售获利而不注重本身角色实力的提升；<br \/>\r\n(7)利用失落的王座游戏行为和游戏内容组织或参与赌博、实施或参与实施盗窃他人财产或游戏道具等涉嫌违法犯罪行为的；<br \/>\r\n(8)其他任何不以正常的游戏娱乐需要为目的的游戏内牟利行为。<br \/>\r\n6.4.7不得使用异常的方法登录游戏（包括但不限于使用非失落的王座开发、授权或认可的第三方软件、系统登录游戏）、使用作废信用卡、盗窃他人信用卡等手段（俗称“黑卡”）进行充值、使用网络加速器等外挂软件或机器人程序等恶意破坏服务设施、扰乱正常服务秩序的行为；<br \/>\r\n6.4.8不得制作、传播或使用外挂、封包、加速软件及其它各种作弊程序，或组织、教唆他人使用此类软件程序，或销售此类软件程序而为个人或组织谋取经济利益；<br \/>\r\n6.4.9不得使用任何方式或方法，试图攻击提供游戏服务的相关服务器、路由器、交换机以及其他设备，以达到非法获得或修改未经授权的数据资料、影响正常游戏服务，以及其他危害性目的的任何行为；<br \/>\r\n6.4.10不得利用线上游戏系统可能存在的技术缺陷或漏洞而以各种形式为自己及他人牟利（包括但不限于复制游戏中的游戏道具等）或者从事其他不正当行为；<br \/>\r\n6.4.11未经失落的王座书面许可，不得使用失落的王座任何知识产权，来创造或提供相同或类似的网络服务，如仿真服务器、私人服务器等；<br \/>\r\n6.4.12不得利用失落的王座产品和网络服务系统进行任何可能对互联网的正常运转造成不利影响或可能干扰他人以正常方式使用失落的王座所提供的产品和网络服务的行为；<br \/>\r\n6.4.13不得利用失落的王座网络服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的、欺诈性的或其他任何非法的信息资料；<br \/>\r\n6.4.14不得利用失落的王座服务系统进行其他不利于失落的王座的行为；<br \/>\r\n6.4.15不得利用失落的王座的服务或产品进行违规喊话、违规操作，包括但不限于发送或传播第三方网址、游戏交易平台、诱导其他用户搜索第三方游戏平台、第三方交易信息、代练、代充值等信息；<br \/>\r\n6.4.16就失落的王座及合作商业伙伴的服务、产品、业务咨询应采取失落的王座指定的客户服务渠道和其他专门沟通渠道，不得在公众场合发布有关失落的王座及其相关服务的负面宣传；<br \/>\r\n6.4.17不得以违反游戏使用规则等非正常方式获得游戏中的权益（包括但不限于游戏币、游戏道具等）；<br \/>\r\n6.4.18不得利用失落的王座所提供的产品和服务在现实中获得盈利；<br \/>\r\n6.4.19不得利用失落的王座的服务或产品发送或传播敏感信息和违反国家法律制度的信息，包括但不限于：<br \/>\r\n(1)反对宪法所确定的基本原则的；<br \/>\r\n(2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br \/>\r\n(3)损害国家荣誉和利益的；<br \/>\r\n(4)煽动民族仇恨、民族歧视，破坏民族团结的；<br \/>\r\n(5)破坏国家宗教政策，宣扬邪教和封建迷信的；<br \/>\r\n(6)散布谣言，扰乱社会秩序，破坏社会稳定的；<br \/>\r\n(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br \/>\r\n(8)侮辱或者诽谤他人，侵害他人合法权益的；<br \/>\r\n(9)任何经失落的王座合理判断为不妥当或者失落的王座未认可的软件、文件及其他内容的；<br \/>\r\n(10)含有法律、行政法规禁止的其他内容的。<br \/>\r\n6.5如发现任何非法使用用户账号或账号出现安全漏洞的情况，应立即通知失落的王座。<br \/>\r\n6.6用户只能通过失落的王座游戏内置的交换途径和经失落的王座官方认可的第三方交易平台进行游戏账号下的权益（包括但不限于游戏币、游戏装备等）的交换或转让。在非失落的王座提供或认可的交易平台上进行游戏道具的交易，将不受失落的王座认可或保护，由此产生的纠纷应由用户自行解决。同时未经失落的王座允许不得将失落的王座游戏产品中的游戏账号、角色人物、游戏道具等与现实货币或者实物进行兑换，否则失落的王座将视为用户无条件放弃进行兑换的服务。用户有本条规定之行为时，失落的王座有权中止或终止向用户提供前述行为所涉及的服务内容，而无需承担任何赔偿责任。<br \/>\r\n6.7当用户账号涉嫌盗号、外挂等非法和违规行为时，用户应配合失落的王座的工作，据实回答游戏管理人员提出的与使用失落的王座产品相关的问题，以维护自己和其他用户在游戏中的合法权益。用户同意以游戏产品程序中的监测数据作为判断用户账号是否盗号、是否有通过使用外挂程序等方法进行的游戏作弊行为以及其他违规行为的依据，除非用户能够提供充分、合法的证据证明其账号使用权、游戏道具、游戏币等的合法来源等来推翻监测数据。用户进一步同意，若失落的王座根据监测数据判定其账号\/游戏道具、游戏币是通过盗号、使用外挂或其他违规行为所得，失落的王座有权先对账号采取封停，对游戏道具、游戏币采取包括但不限于退还失主、删除或取消账号下相关权益等相关措施。<br \/>\r\n6.8用户同意失落的王座出于遵守法律法规要求保密的义务，失落的王座仅有义务向具有独立调查取证权的行政、司法、监管机关出示用户涉嫌盗号、使用外挂和其他失落的王座认为违规的证据，失落的王座无义务向该涉嫌用户出示前述证据。<br \/>\r\n6.9失落的王座可以根据用户的申请提供被盗物品找回服务，但基于游戏的特性，失落的王座不对找回结果做任何明示或默示的承诺，用户需按照失落的王座的要求阅读找回须知、提交相关材料并自行承担相关后果。<br \/>\r\n<br \/>\r\n7.取消账号和终止、中止（即有期限停止）服务<br \/>\r\n7.1用户有如下任何一种或多种行为的，失落的王座有权取消该用户账号或终止或中止对该用户的全部或部分服务（包括但不限于封停该用户名下全部或部分账号和禁止有关角色登录），并且有权取消或收回用户在游戏内通过违规行为获取的不当利益：<br \/>\r\n(1)有违反本协议第6.4条的行为；<br \/>\r\n(2)滥用所享有的权利；<br \/>\r\n(3)提供虚假注册信息（包括但不限于身份信息和联系方式）；<br \/>\r\n(4)失落的王座依据其判断，认为用户账号存在高危被盗风险；<br \/>\r\n(5)有违反失落的王座发布的其他服务规则的行为或通过不正当手段使用失落的王座服务的；<br \/>\r\n(6)有损失落的王座及相关权利人、关联企业或合作对象的权益和其他用户合法权益的行为；<br \/>\r\n(7)有违反法律、法规禁止性规定（包括但不限于发布违法信息）的行为；<br \/>\r\n(8)有违背社会善良风俗和社会公德的行为；<br \/>\r\n(9)有其他违反失落的王座相关规定的行为；<br \/>\r\n(10)除上述情况外，用户在接受失落的王座服务时实施了其他不正当行为的；<br \/>\r\n其中：若失落的王座根据上述第（1）项和第（3）项情形做出中止对用户提供全部或部分服务的决定，则应告知用户中止期限，中止期限应该是合理的，中止期限届满失落的王座应当及时恢复对用户的服务。但中止期限届满时，用户的违规、违约状态仍然存在的，失落的王座有权延长中止服务的期限。 <br \/>\r\n7.2失落的王座通过内部的监测程序发现或经其他用户举报发现用户有可能从事第7.1条所列行为，则失落的王座有权作出独立的判断并采取相应的措施，该措施包括但不限于限制用户账号的登陆、限制用户在游戏中的活动，中止、终止对该用户名下部分或所有账号的服务。<br \/>\r\n7.3同一用户注册的账号中有一个账号或多个账号出现违反本协议约定的行为，失落的王座有权根据实际情况，中止、终止对该用户名下部分或所有账号的服务，或取消该用户名下部分或所有账号。<br \/>\r\n7.4在一个账号充值之前，失落的王座对其提供的是完全免费的服务。基于免费服务的成本限制，失落的王座有权根据运营需要随时终止对该账号的服务。账号充值之后，失落的王座有权根据本协议第9条的规定终止对该账号的服务。<br \/>\r\n7.5若一个账号连续360天（包时用户自包时到期日起计算）未登录失落的王座，视为用户放弃该账号，失落的王座服务系统可以不再保留该账号及与该账号有关的数据，用户不得以此向失落的王座主张任何权利。<br \/>\r\n<br \/>\r\n8.网络服务中断 <br \/>\r\n发生下列情形之一时，即使未经通知，失落的王座有权中断所提供的网络服务，并不需要向用户承担任何责任： <br \/>\r\n8.1定期对有关的网站服务器或游戏服务器及其他网络设备或所提供的产品和网络服务的相关官方网站进行必要的维护、保养及施工；用户可以到失落的王座官方网站和游戏公告中查询每日停机维护时间；<br \/>\r\n8.2根据失落的王座的判断，随时对有关的网站服务器或游戏服务器及其他网络设备或所提供的产品和网络服务的相关官方网站进行必要的维护、保养及施工；<br \/>\r\n8.3因失落的王座、失落的王座的合作方或电信网络系统软硬件设备的故障、失灵或人为操作的疏失；<br \/>\r\n8.4他人侵入失落的王座的网络，篡改、删改或伪造、编造网站数据，或实施了任何影响失落的王座计算机系统正常运行的行为；<br \/>\r\n8.5不可抗力原因；<br \/>\r\n8.6由于相关机构基于法律或法定程序的要求；<br \/>\r\n8.7其他基于法律或国家政策的规定。<br \/>\r\n<br \/>\r\n9.终止服务 <br \/>\r\n9.1失落的王座可根据实际情况终止服务，不管由于任何原因终止服务的，用户应采取相应的措施自行处理账号下的权益，包括但不限于注销或停止使用游戏账号、游戏道具等。<br \/>\r\n9.2用户不得因失落的王座全面终止服务而要求失落的王座承担除用户已经购买但尚未使用的游戏币外任何形式的赔偿或补偿责任，包括但不限于因不再能继续使用游戏账号、游戏道具等而要求的赔偿。<br \/>\r\n9.3终止服务，指失落的王座向停止服务的游戏产品的全部的用户终止服务而非对个别用户进行的封号、禁止登陆、删除游戏道具或游戏币、强制离线等措施。<br \/>\r\n9.4用户理解并同意，失落的王座提供的产品和服务中任何标注为“永久性”、“长期性”等其他同等含义的描述性词汇限定的游戏币、游戏道具或服务，其使用期限不得被解释为永远不会停止，而应被理解为其使用期限截止失落的王座宣布终止网络服务之日或因技术故障而导致数据丢失之日。<br \/>\r\n<br \/>\r\n10.个人信息保护<br \/>\r\n保护用户的个人信息是失落的王座的一项基本政策。失落的王座重视对您的个人信息的保护，一直并将继续努力采取各种合理的物理、电子和管理方面的安全措施来保护用户信息。<br \/>\r\n用户同意，为了解用户需求和提升服务质量，失落的王座有权定期或不定期向用户的电子邮箱、手机号码或其他用户提供的联系方式发送有关的信息；失落的王座有权搜集必要的用户数据，在不泄露用户隐私信息的前提下，失落的王座有权自己或和第三方合作对用户数据进行分析和商业化使用。<br \/>\r\n对失落的王座产品或服务中出现的标注第三方来源的信息，用户应当独立判断进行查看或点击，失落的王座对此不承担任何保证、担保、赔偿或其他相关责任。<br \/>\r\n<br \/>\r\n11.未成年人使用条款 <br \/>\r\n11.1失落的王座将按照相关法律法规和本协议的规定，采取切实有效的措施保护未成年人在使用失落的王座产品和服务过程中的合法权益，包括可能采取实名认证、适龄提示、采取技术措施管控、禁止未成年人接触不适宜的游戏或者游戏功能、限制未成年人的游戏时间，限制消费金额等措施，预防未成年人沉迷网络。<br \/>\r\n11.2失落的王座的用户在使用失落的王座产品和服务的过程中应避免发布、产生任何有损未成年人身心健康的内容，共同营造健康网络环境。<br \/>\r\n11.3未成年人用户的父母或其他监护人对未成年人使用电脑、智能终端设备等行为，以及通过网络游戏充值消费等行为也负有管理、监督的法定义务，应当避免未成年人沉迷游戏，严格控制并提供相关银行或支付账号使用权限，避免未成年人利用成年人账号持续、大额的消费，从而导致不必要的损失。<br \/>\r\n11.4成年人用户或监护人以未成年人实际使用消费为理由申请退费时，应当提供充分的证据加以证实，否则我们无法实施相应的退费。若我们根据法律法规的规定实施退费时，为避免双方纠纷，用户同意根据失落的王座的要求履行必要的身份验证和沟通协助，并签署相关承诺书。<br \/>\r\n<br \/>\r\n12.法律责任 <br \/>\r\n12.1用户同意保障和维护失落的王座及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给失落的王座或任何其他第三人造成损失，用户同意承担由此造成的法律责任（包括但不限于民事责任、行政责任、刑事责任等）。 <br \/>\r\n12.2用户同意补偿失落的王座的母公司、子公司、关联企业、受雇人及一切相关人员，因用户违反相关法律法规或本协议所产生的损害及责任。<br \/>\r\n<br \/>\r\n13.免责声明 <br \/>\r\n13.1在法律允许的最大范围内，失落的王座不会对用户提供不论是明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误等的任何保证和责任。<br \/>\r\n13.2在适用法律允许的最大范围内，失落的王座并不担保失落的王座所提供的产品和服务一定能满足用户的要求，也不担保提供的服务不会被中断，并且对产品和服务的及时性，安全性，出错发生，以及信息是否能准确，及时，顺利的传送均不作任何担保。 <br \/>\r\n13.3在适用法律允许的最大范围内，失落的王座不就因用户使用失落的王座的产品和服务引起的，或在任何方面与失落的王座的产品和服务有关的任何意外的、非直接的、特殊的、或间接的损害或请求承担任何责任。<br \/>\r\n14.4失落的王座仅对本协议中列明的责任及范围负责，因政府行为、或法律法规或国家相关主管部门新颁布、变更的法令、政策导致失落的王座不能提供相关产品和服务的，不视为失落的王座违约。<br \/>\r\n<br \/>\r\n15.送达和通知 <br \/>\r\n本协议项下所有的通知均可通过重要页面公告、电子邮件、常规的信件、手机短信、产品客户端消息推送等方式进行。该等通知于发送之日视为已送达收件人。<br \/>\r\n<br \/>\r\n17.其他规定 <br \/>\r\n17.1基于业务发展等原因，失落的王座的相关游戏可能由不同的关联企业所实际运营，或许需要将本协议项下的权利义务在关联企业间进行转让或转让给第三方，届时失落的王座将按照本协议约定的方式通知用户。<br \/>\r\n17.2如用户对本协议、失落的王座各项服务规则，或失落的王座提供的产品和服务存有任何疑问，可以通过失落的王座客服联系我们，客服邮箱：info@shivagame.com<br \/>\r\n17.3如本协议中的任何内容无论因何种原因完全或部分无效或不具有执行力，本协议的其余内容仍应有效并且对协议各方有约束力。","ext_user_account_notice":"The Lost Throne Account ","developers":["shiva game"],"publishers":["shiva game"],"package_groups":[],"platforms":{"windows":true,"mac":false,"linux":false},"categories":[{"id":2,"description":"Single-player"},{"id":1,"description":"Multi-player"},{"id":20,"description":"MMO"},{"id":49,"description":"PvP"},{"id":36,"description":"Online PvP"}],"genres":[{"id":"37","description":"Free to Play"},{"id":"29","description":"Massively Multiplayer"},{"id":"2","description":"Strategy"}],"screenshots":[{"id":0,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_ae9039773b0988167e7dbfa553aed5cfe472b8e3.600x338.jpg?t=1650649265","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_ae9039773b0988167e7dbfa553aed5cfe472b8e3.1920x1080.jpg?t=1650649265"},{"id":1,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_b3ad619129922cc78df073b11449c75f3db89540.600x338.jpg?t=1650649265","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_b3ad619129922cc78df073b11449c75f3db89540.1920x1080.jpg?t=1650649265"},{"id":2,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_3049c5d035f7a192e505ca26d074a3ba9d28408d.600x338.jpg?t=1650649265","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_3049c5d035f7a192e505ca26d074a3ba9d28408d.1920x1080.jpg?t=1650649265"},{"id":3,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_b2870baa1a85eace5a058e2f3274220a10504f28.600x338.jpg?t=1650649265","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_b2870baa1a85eace5a058e2f3274220a10504f28.1920x1080.jpg?t=1650649265"},{"id":4,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_78af0900842b92a355ca863c9f8aa90262aaabde.600x338.jpg?t=1650649265","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_78af0900842b92a355ca863c9f8aa90262aaabde.1920x1080.jpg?t=1650649265"},{"id":5,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_f55754ed9df001da72d327ef4f8c17085f97758e.600x338.jpg?t=1650649265","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_f55754ed9df001da72d327ef4f8c17085f97758e.1920x1080.jpg?t=1650649265"},{"id":6,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_191689152d2f6f093cb9875a4e1430b0a72da4e1.600x338.jpg?t=1650649265","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/ss_191689152d2f6f093cb9875a4e1430b0a72da4e1.1920x1080.jpg?t=1650649265"}],"movies":[{"id":256882647,"name":"The Lost Throne-cg02","thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256882647\/movie.293x165.jpg?t=1650332495","webm":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256882647\/movie480_vp9.webm?t=1650332495","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256882647\/movie_max_vp9.webm?t=1650332495"},"mp4":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256882647\/movie480.mp4?t=1650332495","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256882647\/movie_max.mp4?t=1650332495"},"highlight":true}],"release_date":{"coming_soon":true,"date":"This Winter"},"support_info":{"url":"www.shivagame.com","email":"info@shivagame.com"},"background":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/page_bg_generated_v6b.jpg?t=1650649265","background_raw":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1188420\/page.bg.jpg?t=1650649265","content_descriptors":{"ids":[],"notes":null}}}}