{"1985310":{"success":true,"data":{"type":"demo","name":"SIR ABANDON Demo","steam_appid":1985310,"required_age":0,"is_free":true,"detailed_description":"The project of this game was conceived in 2017. It is an RPG type game, in retro 2D. You play as a knight <strong>Sir Abandon<\/strong> who will evolve through many levels.<br><br><br>You will have to collect enough gold to improve your equipment, and for this you will have to do and redo the same levels several times.<br><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/extras\/Produce_1.GIF?t=1651875262\" \/><br><br>You will also need to kill simple small enemies to gain experience. Like Slimes, Bats, and other whimsical creatures. The world of Sir Abandon is heavily populated with them, which will make it easy for you to level up.<br><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/extras\/Produce_2.GIF?t=1651875262\" \/><br><br>But, you will also come across monsters that are much smarter, more powerful, and which will be more difficult to defeat.<br><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/extras\/Produce_3.GIF?t=1651875262\" \/><br><br>Once the experience bar is full, you will pass a level, which in addition to your improvements in armor, weapons, and other equipment, will allow you to increase in power. To be able to be equipped with the equipment whose minimum level will be required.<br><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/extras\/Produce_4.GIF?t=1651875262\" \/><br><br>The world in which Sir Abandon will travel in search of his destiny will be strewn with pitfalls, quests, and friends who will help him defeat the <strong>Gorilla of Alvina !<\/strong>","about_the_game":"The project of this game was conceived in 2017. It is an RPG type game, in retro 2D. You play as a knight <strong>Sir Abandon<\/strong> who will evolve through many levels.<br><br><br>You will have to collect enough gold to improve your equipment, and for this you will have to do and redo the same levels several times.<br><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/extras\/Produce_1.GIF?t=1651875262\" \/><br><br>You will also need to kill simple small enemies to gain experience. Like Slimes, Bats, and other whimsical creatures. The world of Sir Abandon is heavily populated with them, which will make it easy for you to level up.<br><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/extras\/Produce_2.GIF?t=1651875262\" \/><br><br>But, you will also come across monsters that are much smarter, more powerful, and which will be more difficult to defeat.<br><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/extras\/Produce_3.GIF?t=1651875262\" \/><br><br>Once the experience bar is full, you will pass a level, which in addition to your improvements in armor, weapons, and other equipment, will allow you to increase in power. To be able to be equipped with the equipment whose minimum level will be required.<br><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/extras\/Produce_4.GIF?t=1651875262\" \/><br><br>The world in which Sir Abandon will travel in search of his destiny will be strewn with pitfalls, quests, and friends who will help him defeat the <strong>Gorilla of Alvina !<\/strong>","short_description":"It's action rpg.","fullgame":{"appid":"1985300","name":"SIR ABANDON"},"supported_languages":"English<strong>*<\/strong><br><strong>*<\/strong>languages with full audio support","header_image":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/header.jpg?t=1651875262","website":"https:\/\/www.retro-role-playing-game.com\/","pc_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<br><\/li><li><strong>OS:<\/strong> Windows XP SP2 or later<br><\/li><li><strong>Processor:<\/strong> Dual Core 2.0 Ghz or higher<br><\/li><li><strong>Memory:<\/strong> 128 MB RAM<br><\/li><li><strong>Graphics:<\/strong> 512<br><\/li><li><strong>DirectX:<\/strong> Version 9.0<br><\/li><li><strong>Storage:<\/strong> 500 MB available space<br><\/li><li><strong>Sound Card:<\/strong> any<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<\/li><\/ul>"},"mac_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<\/li><\/ul>"},"linux_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li>Requires a 64-bit processor and operating system<\/li><\/ul>"},"legal_notice":"Legal notice  and privacy policy<br \/>\r\n <br \/>\r\nThe sole proprietorship Liece Slimani, concerned about the  rights of individuals, particularly with regard to  automated processing and in a desire for transparency with its customers, has set  up a policy covering all these   processing, the purposes pursued by  the  latter as well as  the means of action available to individuals so that they can best exercise their rights. <br \/>\r\nFor any additional information  on the collection of  personal data, we  invite you to consult the website: https:\/\/www.cnil.fr\/<br \/>\r\n <br \/>\r\n  The continuation of navigation on this site implies unreserved acceptance  of the following provisions and conditions of use.<br \/>\r\n  The currently  online version  of these terms of use is the only one enforceable for  the duration of use of the site and until a new version replaces it.<br \/>\r\n<br \/>\r\nArticle 1 - Legal notice<br \/>\r\n<br \/>\r\n1.1 Site (hereinafter \"the Site\"):<br \/>\r\n <br \/>\r\nhttps:\/\/www.retro-role-playing-game.com<br \/>\r\n <br \/>\r\n1.2 Publisher (hereinafter \"the Publisher\"):<br \/>\r\n <br \/>\r\nThe individual company  Retro-Role-Playing-Game<br \/>\r\nlocated : 59198, Haspres ( FRANCE )<br \/>\r\nregistered with the RCS of <br \/>\r\nTelephone number  : 0637912378<br \/>\r\naddress mail : RRPG.2022@gmail.com<br \/>\r\n <br \/>\r\n1.3 Host (hereinafter \"the Host\"):<br \/>\r\n <br \/>\r\nhttps:\/\/www.retro-role-playing-game.com is hosted by Valve S.a.r.l., whose registered office is located at Regus City Center Suite 227 26 Boulevard Royal L-2449 Luxembourg.<br \/>\r\n<br \/>\r\n <br \/>\r\nArticle 2 - Access to the site<br \/>\r\n<br \/>\r\nAccess to the site and its use are reserved for strictly personal  use. You  agree not to use this site and the information or data contained therein for commercial, political, advertising purposes and for any form of  commercial solicitation and in particular the sending    unsolicited e-mails.<br \/>\r\n<br \/>\r\nArticle 3 - Content of the site<br \/>\r\n<br \/>\r\n All trademarks, photographs, texts, comments, illustrations, animated or non-animated images,  video sequences, sounds, as well as all computer applications  that could be used to operate this   site and more generally  all the elements reproduced or used on the site are protected by the laws in force under intellectual property. <br \/>\r\nThey are the  full and entire property of the publisher or its partners.  Any reproduction, representation, use or adaptation, in any form  whatsoever, of all or part of these elements, including computer applications, without  prior agreement  and writing of the publisher, are strictly prohibited. The fact that the publisher does not initiate proceedings as soon as it becomes aware of   these unauthorized uses  does  not constitute acceptance of said uses  and waiver of proceedings. <br \/>\r\n<br \/>\r\nArticle 4 - Site management<br \/>\r\n<br \/>\r\nFor the proper management of the site, the publisher may at any time:<br \/>\r\n- suspend, interrupt or limit access to all or part of the site, reserve access to the site, or certain  parts of the site, to a specific category of Internet users;<br \/>\r\n - delete any information that may  disrupt its operation or contravene  national or international laws;<br \/>\r\n- suspend the site in order  to make updates.<br \/>\r\n<br \/>\r\nArticle 5 - Responsibilities<br \/>\r\n<br \/>\r\nThe responsibility of the publisher can not  be engaged in case of failure, failure, difficulty or interruption of operation, preventing access to the site or one of its functionalities.<br \/>\r\nThe  site connection material you use is under your full responsability.   You must take all appropriate measures to protect your equipment and your own data, including from  virus attacks via the Internet.   You are  also solely  responsible for the sites and data you visit.<br \/>\r\n <br \/>\r\n  The publisher cannot be held responsible in the event of legal proceedings  against you: <br \/>\r\n- because of the use of the site or any service accessible via the Internet;<br \/>\r\n- due to your  non-compliance with these terms and conditions.<br \/>\r\n <br \/>\r\nThe publisher   is not responsible for any damage caused to you, third parties and\/or your equipment as a result of your connection or use of the site and you waive any action against he as a  result.<br \/>\r\nIf the publisher were  to be the subject of an amicable or judicial procedure due  to your use of the site, he may turn  against you to obtain compensation  for all damages , sums, convictions and costs that could arise from this procedure.<br \/>\r\n<br \/>\r\nArticle 6 - Hypertext links<br \/>\r\n<br \/>\r\nThe establishment by users  of any hypertext links  to all or part of the site is authorized by the publisher. Any link must be removed at the  request  of the publisher. <br \/>\r\nAny information accessible via a link to other sites is not published by the publisher.  The publisher has no  rights to the content contained in the said link. <br \/>\r\n<br \/>\r\nArticle 7 - Data collection and protection <br \/>\r\n <br \/>\r\nYour data  is collected by the sole proprietorship  Liece Slimani.<br \/>\r\nPersonal data  means any information concerning an identified or identifiable natural  person (data subject);  an  identifiable  person  is a person who can be identified, directly or indirectly, in particular by reference to a name,  an identification number or to one or more elements specific, specific to its  physical, physiological, genetic, psychic, economic, cultural or social identity.<br \/>\r\nThe  personal information that may be collected on the site  is  mainly used by the publisher for the management of relations with you, and  if necessary for the processing of your orders. <br \/>\r\n <br \/>\r\nThe  personal data collected are as follows:<br \/>\r\n- name and surname<br \/>\r\n- address mail<br \/>\r\n- date of birth<br \/>\r\n-  financial data: as part of the payment of the products and services offered on the Platform, it records financial data relating to the user's credit  card.<br \/>\r\n <br \/>\r\nArticle 8 - Right of access, rectification and de-referencing of your data<br \/>\r\n <br \/>\r\nIn application of the regulations applicable to  personal data, users have the  following rights  :<br \/>\r\n•\tthe right of access: they can exercise their right of access, to know the  personal data concerning them,  by writing to the electronic address mentioned below. In this case, before   the implementation of this right, the Platform may request  proof of the user's identity  in order to verify its accuracy;<br \/>\r\n•\tthe right  to rectification: if the personal data held by the Platform are inaccurate, they may request that the information be updated  ;<br \/>\r\n•\t  the right  to  erasure of data: users  may request the deletion of their personal data,  in accordance with  applicable data protection laws;<br \/>\r\n•\t  the right to restriction of processing: users may request the Platform to limit the processing of  personal data in accordance with  the assumptions provided for by the GDPR;<br \/>\r\n•\t  the right to object to data processing  : users  may object to their data being processed in  accordance with the assumptions provided for by the GDPR;<br \/>\r\n•\tthe  right to portability: they can request that the Platform give them the  personal data they have provided to transmit them  to a new Platform. <br \/>\r\nYou can exercise this right by contacting us at the following address  :<br \/>\r\n2A rue d'Avesnes le Sec Haspres.<br \/>\r\n <br \/>\r\nOr by email, at  :<br \/>\r\nRRPG.2022@gmail.com <br \/>\r\n <br \/>\r\nAny request must be     accompanied by a photocopy of a  valid signed identity document and mention the address at which the publisher can contact the applicant. The response will be sent within one month  of receipt of the request. This period of one month may be extended by  two months if the complexity of the request and\/or the number of requests so requires.<br \/>\r\n <br \/>\r\nIn addition, and since the law n ° 2016-1321 of October 7  , 2016, people  who wish, have the possibility to organize the fate of their data after their death. For more information on the subject, you can consult the CNIL website: https:\/\/www.cnil.fr\/.<br \/>\r\n <br \/>\r\nUsers can also lodge a complaint with the CNIL on the CNIL website: https:\/\/www.cnil.fr. <br \/>\r\n <br \/>\r\n We recommend that you contact us  first before filing a complaint with the CNIL, as we are at your entire disposal to solve your problem.  <br \/>\r\n <br \/>\r\nArticle 9 - Use of data<br \/>\r\n <br \/>\r\nThe    purpose of  the  personal data collected from users is to provide the services of the Platform, improve them and maintain a  secure environment. The legal basis  for the processing is the execution of the contract between the user and the Platform. Specifically, the uses are as follows:<br \/>\r\n <br \/>\r\n- access and use of the Platform by the user;<br \/>\r\n- management of the operation and optimization of the Platform;<br \/>\r\n - implementation  of user assistance;<br \/>\r\n- verification, identification and authentication of the data transmitted by the user;<br \/>\r\n - personalization of the services  by displaying  advertisements  based on the user's browsing  history, according to his preferences;<br \/>\r\n- prevention and detection of fraud, malware (malicious  software or malware) and management of security incidents  ;<br \/>\r\n- management of any disputes with users;<br \/>\r\n- sending  commercial and advertising information,  according to the user's preferences  ;<br \/>\r\n- organization of the conditions of use of the Payment Services.<br \/>\r\n <br \/>\r\nArticle 10 - Data retention policy<br \/>\r\n <br \/>\r\nThe Platform keeps your data for the time necessary to  provide you with its services or assistance. <br \/>\r\nTo the extent reasonably necessary or required to  meet legal or regulatory obligations  , resolve disputes, prevent fraud and abuse, or enforce our terms and conditions, we  may also retain some of your information if necessary, even after you have closed your account or we no longer need to  provide you with  our services.<br \/>\r\n <br \/>\r\nArticle 11- Sharing of personal data  with third parties<br \/>\r\n <br \/>\r\nPersonal data  may be shared with  third-party companies exclusively in the European Union, in the  following cases:<br \/>\r\n- when the user uses the payment services, for the  implementation of these services, the Platform is in contact with  third-party  banking and financial companies with which  it has concluded contracts  ;<br \/>\r\n - when the user publishes, in the  free comment areas of the Platform, publicly available information;<br \/>\r\n- when the user authorizes the website of a third party to access his data;<br \/>\r\n- when the Platform uses the services of service providers to provide  user support, advertising and payment services.  These service providers have  limited access to  the user's data, in the context of the performance of these services, and have the contractual obligation to use them  in accordance with the provisions of the   applicable regulations on the protection of  personal data;<br \/>\r\n- if   required by law, the Platform may transmit data to follow up on claims against the Platform and comply with  administrative and judicial procedures.<br \/>\r\n <br \/>\r\nArticle 12 - Commercial offers <br \/>\r\n <br \/>\r\nYou may receive commercial offers  from the publisher. If you do  not wish to do so, please click on the following link  : rrpg.2022@gmail.com.<br \/>\r\nYour data  may be used by the  publisher's partners for commercial prospecting purposes, if you do  not wish to do so, please click on the following link  : rrpg.2022@gmail.com.<br \/>\r\nIf, during the consultation of the site, you access personal data, you must  refrain from any collection, any unauthorized use  and any act that may constitute a  invasion of privacy  or reputation of individuals.  The publisher declines all responsibility in this regard.<br \/>\r\nThe data is kept and used for a period in accordance with the legislation in force.<br \/>\r\n<br \/>\r\nArticle 13 - Cookies<br \/>\r\n <br \/>\r\nWhat is a \"cookie\"?<br \/>\r\nA \"  Cookie\" or tracer is an  electronic file deposited on a terminal (computer, tablet, smartphone,...) and read for example during the consultation of a website, the reading of an  e-mail, the installation or the the use of software  or a mobile application,  regardless  of the type of terminal used (source:  https:\/\/www.cnil.fr\/fr\/cookies-tracers-que-dit-la-loi).<br \/>\r\nThe site may  automatically collect  standard information.   All information collected indirectly will  only be used to track the volume, type and configuration of traffic using this site, to  develop its design and layout and  for other purposes  administrative and planning and more generally to improve the service we  offer you.<br \/>\r\n <br \/>\r\n If necessary, \"cookies\" from the publisher of  the  site and \/ or  third party companies may be deposited on your terminal, with your agreement. In this case, during the first navigation on this site, an  explanatory banner on the use of \"cookies\" will appear. Before continuing browsing, the customer and\/or prospect must accept or refuse the use of said \"cookies\".  The consent given will be valid for a period of thirteen (13) months.  The user has the  possibility to disable cookies at any time.<br \/>\r\n <br \/>\r\nThe following  cookies  are present on this site:<br \/>\r\nCookies Google :<br \/>\r\n- Google analytics: to measure the audience of the site; <br \/>\r\n- Google tag manager: facilitates the implementation of tags on pages and allows you to manage  Google tags; <br \/>\r\n- Google Adsense:  Google's advertising network using YouTube  websites or videos as a medium for its ads;  <br \/>\r\n- Google Dynamic Remarketing: allows you to offer  dynamic advertising based on previous searches;  <br \/>\r\n- Google Adwords Conversion: tool for tracking  adwords advertising campaigns;  <br \/>\r\n- DoubleClick: Google's advertising cookies  to distribute banners.<br \/>\r\n <br \/>\r\nCookies Facebook :<br \/>\r\n- Facebook connect: allows you  to identify yourself using your  Facebook account; <br \/>\r\n- Facebook social plugins: allows you to like, share, comment on content with a  Facebook account; <br \/>\r\n- Facebook Custom Audience: allows you to interact with the audience on Facebook.<br \/>\r\n <br \/>\r\nCookies Twitter :<br \/>\r\n- Twitter button: allows you to  easily share and display  Twitter content; <br \/>\r\n- Twitter advertising: allows you to display and target  advertisements  by Twitter's advertising network.<br \/>\r\n <br \/>\r\n- youtube.<br \/>\r\n  <br \/>\r\nThe lifetime of these cookies is thirteen months.<br \/>\r\n<br \/>\r\nArticle 14 - Photographs and representation of products<br \/>\r\n<br \/>\r\nThe product photographs, accompanying their description, are not contractual and do not  bind the publisher.<br \/>\r\n<br \/>\r\nArticle 15 - Applicable law<br \/>\r\n<br \/>\r\nThese conditions of use of the site are governed by  French law and subject to the jurisdiction of  the courts of the publisher's registered office, subject  to  a specific  attribution of jurisdiction arising from a  particular piece  of legislation or regulation.<br \/>\r\n<br \/>\r\nArticle 16 - Contact us<br \/>\r\n<br \/>\r\nFor any question, information about the products presented on the site, or concerning the site itself, you can leave a message to  the  following adresse: RRPG.2022@gmail.com.     <br \/>\r\n <br \/>\r\n <br \/>\r\nThis legal notice and privacy policy  have been created on the Rocket Lawyer website.","developers":["RRPG"],"publishers":["Retro Role Playing Game"],"package_groups":[],"platforms":{"windows":true,"mac":false,"linux":false},"categories":[{"id":2,"description":"Single-player"},{"id":10,"description":"Game demo"}],"screenshots":[{"id":0,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/ss_c00946ef7d584ad4f5463d681d43c7aec704e93c.600x338.jpg?t=1651875262","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/ss_c00946ef7d584ad4f5463d681d43c7aec704e93c.1920x1080.jpg?t=1651875262"},{"id":1,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/ss_4bfb841a5cd0c38a63a34a146ea8d1f1fe9adadc.600x338.jpg?t=1651875262","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/ss_4bfb841a5cd0c38a63a34a146ea8d1f1fe9adadc.1920x1080.jpg?t=1651875262"},{"id":2,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/ss_1a78924ba6b826ac1dad8d8f3918438081d7cc28.600x338.jpg?t=1651875262","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/ss_1a78924ba6b826ac1dad8d8f3918438081d7cc28.1920x1080.jpg?t=1651875262"},{"id":3,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/ss_a8fab27d1edc5aab4684c6e579bb919ce63b0a3b.600x338.jpg?t=1651875262","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/ss_a8fab27d1edc5aab4684c6e579bb919ce63b0a3b.1920x1080.jpg?t=1651875262"},{"id":4,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/ss_77fac0a51d3edb36f96c408982ba564037213b1f.600x338.jpg?t=1651875262","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/ss_77fac0a51d3edb36f96c408982ba564037213b1f.1920x1080.jpg?t=1651875262"}],"achievements":{"total":11,"highlighted":[{"name":"50 Gold","path":"https:\/\/cdn.akamai.steamstatic.com\/steamcommunity\/public\/images\/apps\/1985310\/fecb1726a174af22e38c05adeb03d3c2686565f3.jpg"},{"name":"100 Gold","path":"https:\/\/cdn.akamai.steamstatic.com\/steamcommunity\/public\/images\/apps\/1985310\/c5503abb0ddd1748add3698b9cf958d50eb9207e.jpg"},{"name":"500 Gold","path":"https:\/\/cdn.akamai.steamstatic.com\/steamcommunity\/public\/images\/apps\/1985310\/062ffc219cbf50a24e49cff30f68b9155f9a235a.jpg"},{"name":"1000 Gold","path":"https:\/\/cdn.akamai.steamstatic.com\/steamcommunity\/public\/images\/apps\/1985310\/e181e847a66bc8497bf64a1b10c03360bd88ea1a.jpg"},{"name":"30 Grass","path":"https:\/\/cdn.akamai.steamstatic.com\/steamcommunity\/public\/images\/apps\/1985310\/e49e7df7665baaeb80eed17eda7294f6ab42775e.jpg"},{"name":"100 Grass","path":"https:\/\/cdn.akamai.steamstatic.com\/steamcommunity\/public\/images\/apps\/1985310\/502de102df0f68b877670513b5e058edbba4f61c.jpg"},{"name":"200 Grass","path":"https:\/\/cdn.akamai.steamstatic.com\/steamcommunity\/public\/images\/apps\/1985310\/ab88ecd6b934723e2ae30d7972876edaedd41384.jpg"},{"name":"30 Mines","path":"https:\/\/cdn.akamai.steamstatic.com\/steamcommunity\/public\/images\/apps\/1985310\/e16aed979cf73659feed3d0d88c9f8ef4f4323b2.jpg"},{"name":"100 Mines","path":"https:\/\/cdn.akamai.steamstatic.com\/steamcommunity\/public\/images\/apps\/1985310\/fae5da737c95078d42e652412766d0f3b49dc3a4.jpg"},{"name":"200 Mines","path":"https:\/\/cdn.akamai.steamstatic.com\/steamcommunity\/public\/images\/apps\/1985310\/fae5da737c95078d42e652412766d0f3b49dc3a4.jpg"}]},"release_date":{"coming_soon":false,"date":"3 May, 2022"},"support_info":{"url":"https:\/\/www.retro-role-playing-game.com\/","email":"rrpg.2022@gmail.com"},"background":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/page_bg_generated_v6b.jpg?t=1651875262","background_raw":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1985310\/page_bg_generated.jpg?t=1651875262","content_descriptors":{"ids":[],"notes":null}}}}