{"2058010":{"success":true,"data":{"type":"demo","name":"Lights &amp; Shades: Safìna Demo","steam_appid":2058010,"required_age":0,"is_free":true,"detailed_description":"Take on an unprecedented moment in the Lights e Shades: Safìna!","about_the_game":"Take on an unprecedented moment in the Lights e Shades: Safìna!","short_description":"A 2D turn-based fantasy RPG. Equipped; Grow; Aggregates; Form friendships; Uncover secrets; Fight; You decide. An original storyline, day \/ night cycle, freedom of action and what you do will influence the story.","fullgame":{"appid":"2000260","name":"Lights e Shades: Safìna"},"supported_languages":"Italian","header_image":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/header.jpg?t=1658396691","website":null,"pc_requirements":[],"mac_requirements":[],"linux_requirements":[],"legal_notice":"RPG Maker MZ User License Agreement<br> <br> This User License Agreement (including the attached \"Game Distribution Terms\"; hereafter \"This Agreement\") applies to all relationships between the purchaser (including the individuals who install this software on a computer or other device in the event that such person is distinct from the purchaser; hereafter \"User\") of \"RPG Maker MZ\" (hereinafter \"This Software\"), a product of Gotcha Gotcha Games Inc. (hereinafter \"Company\"). The User must read this Agreement carefully before using this Software. You will be deemed to have consented to this Agreement upon initiation of the installation of this Software.<br><br>If you are a minor, this Software must be installed based on the consent (including consent to this Agreement) of a parent or other legal guardian. In the event that the minor User as a result of consenting to this Agreement reaches the age of majority and subsequently uses the Software, the additional consent for use during the period that such User was a minor will be considered as granted.<br><br> Also, in case terms of use and precautions, etc. (hereinafter \"Terms of Use, etc.\") are entered into by the Company on the official website <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=http:\/\/(https:\/\/tkool.jp\/support\/)\" target=\"_blank\" rel=\"noopener\"  >(https:\/\/tkool.jp\/support\/)<\/a> of this software, the User must adhere to these Terms of Use, etc. as a unit with this Agreement. This software uses the open source \"Qt\" program. The terms of this Agreement do not apply to \"Qt\", but the \"GNU Lesser General Public License\" applies.<br><br>See the end of this agreement for the text thereof.<br><br> Article 1 (Installation)<br><br> The User may use this Software by installing it on a computer or other device (hereinafter \"User Device\").<br><br> In the event that the User owns multiple User Devices, and only in cases where the User is the authorized User of this Software according to Article 3 Paragraph 1, in addition to the installation of the previous paragraph, the User may install This Software on a second User Device only for User use purposes. However, even in such cases, the User cannot allow the use of this Software by third parties as installed on both of the User's Devices.<br><br> Article 2 (Network authentication)<br><br><br> The User will conduct the network authentication of this Software after installation of the same, in accordance with the methods established separately by the Company.<br><br> The User acknowledges that, in the event that the network authentication referred to in the previous paragraph is not completed in a standard way, this Software cannot be started or used, regardless of the reasons for such failure.<br><br> Article 3 (User Registration)<br><br> The User will register the user for this software at the beginning of the use of the same, in accordance with the methods stipulated separately by the Company, and will become an authorized user (hereinafter \"Authorized User\") of this software upon completion of called user registration.<br><br><br> The User acknowledges that the Company does not offer support for use, etc. of this Software for any user who has not completed the user registration of the previous paragraph.<br><br> Article 4 (Processing of personal data)<br><br> The Company will process the personal information provided by the User appropriately and in compliance with the law, according to the terms set out in the Company's \"Privacy Policy\" <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=http:\/\/(https:\/\/www.gotchagotcha.jp\/privacy.html)\" target=\"_blank\" rel=\"noopener\"  >(https:\/\/www.gotchagotcha.jp\/privacy.html)<\/a>.<br><br> Article 5 (User license)<br><br> Company grants a license to use this Software in accordance with the following points only in cases where the User is the Authorized User.<br><br><br> (1) Production of original games (hereinafter \"User Games\") using this software (including the computer programs that comprise this software) and resources (including text, music and images, etc .; hereinafter collectively \"Resources company \") contained in this Software. Further, You may not upload, use or otherwise use Company Assets in original games created with personally created programs or game creation tools, etc. provided by third parties without the prior written consent of the Company.<br><br> (2) The transfer, lending, screening, public distribution or licensing of transmission (hereinafter collectively \"Distribution, etc.\") of User Games created under the preceding article, regardless of whether they are compensated or not compensated. However, please note that the User must adhere to the \"Terms of game distribution, etc. \"attached to this Agreement during such Distribution, etc.<br><br>Article 6 (Prohibitions)<br><br> The User will adhere to the user's obligations set out in this Agreement and in the Terms of Use, etc. (hereinafter collectively \"This Agreement, etc.\") and will use this Software appropriately and in compliance with the law.<br><br> You may not engage in any of the following actions while using this Software.<br><br> (1) Permit third party use of this software, as installed on one user device, or installation of this software on three (3) or more user devices. However, the terms of use may be terminated through a separate consultation and the consent of the Company based on an advance request, in the in case multiple licenses are required from educational institutions, etc.<br><br> (2) Removal of security from this software through the use of bugs or malfunctions, etc., or through the use of this software in any way not permitted by the Company, including the production of derivative software by adaptation, translation or modification, etc. This software.<br><br> (3) The duplication, publication, screening, lending, sale, distribution, display, public broadcast or licensing of this Software in whole or in part without the prior written consent of the Company, or separate distribution, etc. computer programs (hereinafter \"Business Programs\") comprising this Software or other Company Assets.<br><br> (4) Violations of this Agreement, etc.<br><br> (5) Infliction of damages to the Company, to any other User or to third parties, or actions that threaten him.<br><br> (6) Any other action that the Company deems inappropriate.<br><br> In the event that the User violates the two preceding paragraphs, the Company may adopt measures such as a warning to the User, etc. Furthermore, in the event that the Company suffers damages from such violation, the User will have to compensate for such damages.<br><br> Article 7 (Reservation of rights)<br><br> All copyrights, copyrights and other intellectual property rights in this software (including company programs and resources) are owned by the Company.<br><br><br> The copyrights, rights relating to copyrights and other intellectual property rights relating to the User Games (excluding the Programs and Company Assets) and the goods produced personally by the User (texts, music, images, etc.) are stored by the User who produced such User Games and goods.<br><br> Article 8 (Disclaimer)<br><br> The Company is not responsible in any way for the damages that the User may suffer as a result of the use of this Software, excluding cases of willful misconduct or negligence on the part of the Company.<br><br> In the event that the Company is liable pursuant to the previous paragraph, excluding cases of willful misconduct or negligence on the part of the Company, its representatives, or its employees, the damages that the User can request from the Company are limited to the standard ones. and direct damages suffered by the User,<br><br>and the Company is in no way liable for any special damages, indirect damages, lost earnings, legal fees or similar damages suffered by the User. In no event must the total amount of damages for which the Company is liable exceed a maximum limit of the purchase price actually paid for this Software by the User.<br><br> The Company will exercise reasonable caution in order to maintain the reliability of this software, but make no warranties regarding the following, in which the user assumes responsibility for the use of this software.<br><br> (1) Compatibility of this software with specific lenses<br><br> (2) Reliability and stability of operation of this software<br><br> The Company is not responsible in any way for any conflicts or disputes between third parties and the User in relation to the use of this Software by the User, or based on the production of Games or User Distribution, etc.<br><br> Article 9 (Amendments to this Agreement, etc.)<br><br> In case of compatibility with the general benefits for the user or of reasonable necessity, the Company may modify this Agreement, etc. without the User's consent. In such cases, the Company will notify the changed items via the official website by the date of one (1) month prior to the effective date of such changes. The amended version of this Agreement, etc. it will take effect from the effective date indicated by the Company on the official website. However, in the event that the User's consent is required by law for the changes, this consent must be acquired in the manner provided by the Company.<br><br>Article 10 (Interpretation of this Agreement, etc.)<br><br> The Japanese language version of this Agreement, etc. will be the official version and translations of this Agreement, etc. in other languages ​​are provided for reference only. In the event of any discrepancy in the interpretation of these references and the official Japanese language version, the interpretations of the official Japanese version will prevail.<br><br> Article 11 (Applicable law)<br><br> Japanese law will be the law governing this Agreement, etc., and Japanese law will be used in its interpretation.<br><br> Article 12 (Jurisdiction)<br><br> In the event that litigation or arbitration is required in connection with this Agreement, the Tokyo District Court in Japan will have exclusive jurisdiction with the mutual consent of the Company and the User.<br><br> [Appendix] Game distribution terms, etc.<br><br> These game distribution terms, etc. (hereafter \"these terms\") set out the terms for the Authorized User of this software to produce and perform distribution, etc. of the user's Games. You must agree to these Terms as a unit with the User License Agreement (hereinafter \"This Agreement\") for this Software. Furthermore, in the absence of specific clauses, the terminology used in these Terms will be that defined in this Agreement.<br><br> Article 1 (Terms of distribution, etc.)<br><br> The User can perform the Distribution, etc. of the User Games only in cases that satisfy all of the following elements.<br><br> (1) You are the authorized user of this software.<br><br> (2) User games must not infringe any rights (copyrights, trademark rights, moral rights or any other rights) or benefits belonging to any third party and must not threaten the infringement as such.<br><br> (3) User Games must not contain computer viruses and computer viruses and other harmful programs (including spam) must not be provided through User Games.<br><br> (4) User games must not violate laws or public morals, or threaten such violations.<br><br><br> (5) User games must not violate this Agreement, etc.<br><br> (6) The User may not take any other action that the Company deems inappropriate.<br><br> The User will carry out the production and distribution, etc. of the Games of the User under his own personal responsibility and will bear the costs, and shall not impose any taxation on the Company.<br><br> Article 2 (Management of company assets)<br><br> You shall manage the Company Assets contained in this Software as follows.<br><br> (1) Company assets may only be used in user games produced with this software.<br><br> (2) Company assets may be modified (colors or sizes changed, inverted, cropped, etc.) only for use in user games produced with this software.<br><br> (3) Company resources or those modified under the preceding article may be subject to distribution, etc. with user games produced with this software. Furthermore, the User cannot carry out the Distribution, etc. of individual Company Assets or those modified, or Distribution, etc. in combination with programs, etc. other than the User Games. However, the User may duplicate, transfer, publicly transmit or allow the free transmission of personally modified Corporate Assets to other Authorized Users.<br><br> Article 3 (Notifications, etc. to Users)<br><br> The User must notify or display the following items to the users of the User Games during the execution of the Distribution, etc. of the User Games.<br><br> (1) Clear indication within the attached documents (within the help files in cases without attached documents or positioned in a visible position for users of the User Games; the same applies from now on) that said Games user were produced using this software.<br><br> (2) The following notice of rights relating to this software should be displayed within the attached documents.<br><br> - Notation: \"© Gotcha Gotcha Games Inc.\/YOJI OJIMA 2020\"<br><br> (3) Extraction of corporate programs or corporate assets from user games and distribution, etc. is prohibited. (regardless of whether they are compensated or not compensated).<br><br><br> (4) Extraction or modification of Company Programs or Company Assets from User Games is prohibited.<br><br> (5) The extraction of company assets from user games for use in the original games (regardless of whether they are paid or uncompensated) is prohibited.<br><br> end<br><br> GNU MINOR GENERAL PUBLIC LICENSE<br><br> Version 3, June 29, 2007<br><br> Copyright © 2007 Free Software Foundation, Inc.<br><br> Everyone is authorized to copy and distribute verbatim copies of this license document, but modification is not permitted.<br><br>This version of the GNU Lesser General Public License incorporates the terms and conditions of version 3 of the GNU General Public License, supplemented by the additional permissions listed below.<br><br> 0. Additional Definitions.<br><br> As used in this document, \"this license\" refers to version 3 of the GNU Lesser General Public License and the \"GNU GPL\" refers to version 3 of the GNU General Public License.<br><br> \"The Library\" refers to a covered work governed by this License, other than an Application or a combined Work as defined below.<br><br> An \"Application\" is any work that makes use of an interface provided by the Library, but that otherwise it is not based on the Library. Defining a subclass of a class defined by the Library is considered to be a way of using an interface provided by the Library.<br><br> A \"Combined Work\" is a work produced by combining or linking an Application with the Library. The particular version of the Library with which the Combined Work was created is also called the “Linked Version”.<br><br> The \"Minimum Corresponding Source\" for a Combined Work means the Corresponding Source for the Combined Work, excluding any source code for parts of the Combined Work which, considered in isolation, are based on the Application and not the linked Version.<br><br> The \"Corresponding Application Code\" for a Combined Work means the object code and \/ or source code of the Application, including all<br><br>data and utilities necessary to reproduce the Combined Work from the Application, but excluding the System Libraries of the Combined Work.<br><br> 1. Exception to Section 3 of the GNU GPL.<br><br> You may transmit a work covered by sections 3 and 4 of this License without being bound by section 3 of the GNU GPL.<br><br> 2. Transmission of modified versions.<br><br> If you edit a copy of the Library and, in your edits, a function refers to a function or data that must be provided by an application using the function (as opposed to an argument passed when the function is invoked), then you can pass a copy of the modified version:<br><br> a) under this License, provided that yes makes a good faith effort to ensure that in the event that an Application does not provide the function or data, the facility still functions and fulfills any part of its purpose remains significant, or<br><br> b) under the GNU GPL, without any of the additional permissions of this License applicable to that copy.<br><br> 3. Object code embedding material from library header files.<br><br> The object code module of an Application can embed material from a header file that is part of the Library. You may convey such object code in terms of your choice, provided that, if the embedded material is not limited to numerical parameters, data structure layouts and accessories, or small macros, inline functions and templates (length ten or less), you perform both following operations:<br><br> a) Give prominent notice with each copy of the object code that the Library is used in it and that the Library and its use are covered by this License.<br><br> b) Accompany the object code with a copy of the GNU GPL and this license document.<br><br> 4. Combined works.<br><br> You may submit a Combined Work under terms of your choice which, taken together, do not actually restrict modification of the parts of the Library contained in the Combined Work and reverse engineering for debugging such modifications, if you also perform each of the following operations :<br><br> a) Give prominent notice with each copy of the combined Work that the Library is used in it and that the Library and its use are covered by this License.<br><br> b) Accompany the combined Work with a copy of the GNU GPL and this license document.<br><br> c) For a combined Work that displays copyright notices during execution, include the copyright notice for the Library among these notices, as well as a reference directing the user to copies of the GNU GPL and this license document.<br><br> d) Do one of the following:<br><br> 0) Transmit the minimum Matching Source under the terms of this License and the corresponding Application Code in a suitable form and in terms that allow the user to recombine or reconnect the Application with a modified version of the Linked Version to produce a modified Combined Work, in the manner specified by section 6 of the GNU GPL to transmit the corresponding Source.<br><br>1) Use a shared library mechanism suitable for linking with the Library. A suitable mechanism is that which (a) uses at runtime a copy of the Library already present on the user's computer system and (b) will work correctly with a modified version of the Library that can be interfaced with the linked Version.<br><br> e) Provide installation information, but only if you would otherwise be required to provide such information under section 6 of the GNU GPL, and only to the extent that such information is required to install and run a modified version of the combined Work produced by recombining or reconnecting the Application with a version modified of the Linked Version. (If you are using the 4d0 option, the installation information must accompany the minimum matching source and the corresponding application code. If you are using the 4d1 option, you must provide the installation information as specified in section 6 of the GNU GPL to transmit the corresponding source.)<br><br> 5. Combined libraries.<br><br> You may place library structures that are a work based on the Library side by side in a single library together with other library structures that are not Applications and are not covered by this License, and transmit that combined library in terms of your choice. , if you do both of the following:<br><br> a) Accompany the combined library with a copy of the same work based on the Library, not combined with other library facilities, transmitted under the terms of this License.<br><br> b) Clearly communicate with the combined library that part of it is a work based on the Library and explaining where to find the accompanying non-combined form of the same work.<br><br> 6. Revised versions of the GNU Lesser General Public License.<br><br> The Free Software Foundation may publish revised and \/ or new versions of the GNU Lesser General Public License from time to time. Such new releases will be similar in spirit to the current version, but may differ in detail to address new problems or concerns.<br><br> Each version is assigned a distinctive version number. If the Library as you received it, specify that a certain numbered version of the GNU Lesser General Public License \"or any later version\", you have the option to follow the terms and conditions of that published version or any later version published by the Free Software Foundation. If the Library you received does not specify a version number of the GNU Lesser General Public License, you can choose any version of the GNU Lesser General Public License ever published by the Free Software Foundation.<br><br> If the Library as received specifies that a proxy can decide whether future versions of the GNU Lesser General Public License should apply, the public declaration of acceptance of any version by the proxy is a permanent permission for you to choose that version. for the Library.","developers":["_mexs_"],"publishers":["_mexs_"],"package_groups":[],"platforms":{"windows":true,"mac":false,"linux":false},"categories":[{"id":2,"description":"Single-player"},{"id":10,"description":"Game demo"}],"screenshots":[{"id":0,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_f4c81bf66b6bec020cb0251b8f87f5b5e126356e.600x338.jpg?t=1658396691","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_f4c81bf66b6bec020cb0251b8f87f5b5e126356e.1920x1080.jpg?t=1658396691"},{"id":1,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_a845816a38fa0506ae24d38551db7de62675adc9.600x338.jpg?t=1658396691","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_a845816a38fa0506ae24d38551db7de62675adc9.1920x1080.jpg?t=1658396691"},{"id":2,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_37b86e42c6c6378485c7ca3b12fb5623e306578e.600x338.jpg?t=1658396691","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_37b86e42c6c6378485c7ca3b12fb5623e306578e.1920x1080.jpg?t=1658396691"},{"id":3,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_fee860e6527347ff7603a6c3bcc77ba008b3a185.600x338.jpg?t=1658396691","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_fee860e6527347ff7603a6c3bcc77ba008b3a185.1920x1080.jpg?t=1658396691"},{"id":4,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_f5d796e28620c096ff84596725f4103cde595485.600x338.jpg?t=1658396691","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_f5d796e28620c096ff84596725f4103cde595485.1920x1080.jpg?t=1658396691"},{"id":5,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_15d66313745ec494b15e7f36196425e5922b07e6.600x338.jpg?t=1658396691","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_15d66313745ec494b15e7f36196425e5922b07e6.1920x1080.jpg?t=1658396691"},{"id":6,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_8897ea6b2c67e48ed9acb5264482748d59f5e8dc.600x338.jpg?t=1658396691","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_8897ea6b2c67e48ed9acb5264482748d59f5e8dc.1920x1080.jpg?t=1658396691"},{"id":7,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_1b9c3c516fa13116e88a1d9c233a75b940408849.600x338.jpg?t=1658396691","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_1b9c3c516fa13116e88a1d9c233a75b940408849.1920x1080.jpg?t=1658396691"},{"id":8,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_c499350c67605a0db76cba2dc721a31f06bec7ad.600x338.jpg?t=1658396691","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_c499350c67605a0db76cba2dc721a31f06bec7ad.1920x1080.jpg?t=1658396691"},{"id":9,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_b19bce7ea6567d96bdba86f0828bbbb3ddd1a55b.600x338.jpg?t=1658396691","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/ss_b19bce7ea6567d96bdba86f0828bbbb3ddd1a55b.1920x1080.jpg?t=1658396691"}],"release_date":{"coming_soon":true,"date":"16 Jul, 2022"},"support_info":{"url":"","email":"alessandro.musso@outlook.it"},"background":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/page_bg_generated_v6b.jpg?t=1658396691","background_raw":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/2058010\/page_bg_generated.jpg?t=1658396691","content_descriptors":{"ids":[],"notes":null}}}}