{"1213420":{"success":true,"data":{"type":"game","name":"Texas Holdem Poker: Solo King","steam_appid":1213420,"required_age":0,"is_free":false,"detailed_description":"The game consists of two parts:<br>1: In the console game section, you can play tournament games and heads-up games against professional-level AI opponents.<br>2: A complete set of Texas Hold'em calculation tools<br>The table below shows the functional price comparison between the computing tools in the game and other Texas-related computing products on the market.<br><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/extras\/en.png?t=1646034589\" \/><br><br>Help players solve two problems:<br>1: Have a complete tool chain: You have purchased a complete set of Texas Hold'em calculation-related tools at a very cheap price, and it calculates correctly and runs stably. It is cheap, comprehensive, and convenient. One account can share data on multiple platforms, and the functions are consistent, and there is no castration.<br>2: Learn the playing strategies of professional poker players: You only play games with professional-level AI and learn the playing strategies of professional poker players. There is no random behavior to confuse you with entertaining AI, and I don't want to waste your time.<br><br>Satisfy player pursuit and advancement:<br>1: When players play Texas Hold'em, they just want to find and master a set of playing strategies that suit their profession. The professional AI I wrote is written in accordance with the standard textbook-style playing strategies of professional poker players, and they are all in standard poker scenarios. fixed action paradigm,<br>It is very fixed, not random, which helps you quickly understand the playing strategies of professional players. to learn this strategy. Your discovery and learning of patterns will not be interfered with by random strategies.<br><br>Don't think it's going to be silly, it plays a lot better than most players in online real money games. You can buy it on steam to try its AI capabilities, if you are not satisfied, you will get an unconditional refund within 2 hours, you have nothing to lose at all.<br><br>This AI uses standard and mature textbook play to fight against you. You can learn the AI's play, understand the AI's play, and find your own way of defeating the AI. It all depends on your own understanding and ability.<br><br>The AI ​​is not responsible for providing you with the thrill of victory, it is up to you to win. The more games you play in the world of online real money gaming, the more severely you feel you are bound, you feel right, you are almost all playing with a group of professional players who rely on a full suite of scientific tools to give real-time calculations and decision-making cues playing. It was people who were heavily armed like me.<br>In fact, the AI ​​strategy in this game basically covers all my action strategy logic. I wrote it to greatly reduce the energy consumption of my decision-making in the poker game.<br><br>The strategies in this game are extremely effective at PokerStars blind levels below $10\/$20. Further up, I don't want to play games with too much stake, so I can't stand up effectively, so I don't level up.<br><br>2): You have learned strategies, and you need a complete set of tools to assist you. Without scientific calculation tools, in real money poker games, you have strategies and dare not use them. The essence of Texas Hold'em is a real mathematical probability game. Data and calculations determine the choice of strategies.<br><br>In the past two years, the Texas Hold'em books handwritten by foreign professional players who have been translated by the player groups on Taobao are very expensive, far more expensive than my game. Those books cost hundreds of yuan, and they are still very popular.<br>This marks that although the state strictly prohibits Texas games, players' pursuit of strategic knowledge has not stopped. They provided some foreign poker experience and strategies, and I provided a professional training ground and toolset that also filled the gaps for the Chinese in terms of Texas science tools.<br><br>3): Optics does not practice, it is natural to learn, and it is valuable to apply what you have learned. You don’t know whether you are cheating or not, and you don’t know why you win or lose. Basically, you are just playing for nothing.<br><br>In this game, you can freely organize the table, freely set the blind level, freely set the hand range of each opponent, freely set the opponent's AI type, and freely set your own hand range, so that every time the card is dealt, the You're dealt hands in this range, and you're also free to set one of the 20 good hands, so there's a definite training.<br>In the game, the various win rate data, listening win rate, and EV data of each player on each street are calculated in real time, saving you the trouble of manual calculation, and also giving you AI decision-making suggestions from professional-level textbooks. These ensure that you can train fully on demand. and judging whether it makes sense for you.<br>The complete display of this information in the game also helps you analyze the game, so that you know the logic of your winning and losing, where you win and where you lose.<br>Don't think that you lost, it was me who cheated, you can understand whether I cheated by reading the data and graphs carefully, you can't understand these, either you have no knowledge of technology and playing cards, or your understanding is too poor, what? It's all clear, you still can't understand it, and it's clear that you don't have the ability to think, and you can't play IQ games, so don't waste time torturing yourself.<br><br>Tell you clearly:<br>1: I sell strategies and tools, and I show you professional strategies in the game.<br>2: The game is sold at a fixed price. Even if you lose all the chips and diamonds, the server will continue to supply chips and diamonds for you to play. There will be no extra charge. I don't need to cheat you for chips and diamonds at all. , I don't even bother with it.<br>3: The chips and diamonds provided are enough for you to play 50000 hands. You need about 500 hours to play them all. For the vast majority of players, they will not spend 500 hours on a certain game. They do not give you a huge amount. The chips and diamonds are also to bring you closer to the real world to play from small stacks, so that it makes sense.<br>4: It is not a multiplayer online crowd gambling game, but a console game, or more precisely, a training tool. The networking function ensures that you can freely share usage data between your mobile phone and computer.<br><br>This game is more precisely a training tool and a tool for assisting actual combat calculation and strategy. I have provided you with a trainer aircraft and a fighter jet, and it is up to you to combine your wisdom, ability and financial resources to control and use it to assist you.<br>If you think you want to train yourself and experience the brutality of professional gambling, then you can play hard.<br><br>It provides you with the basic prerequisite knowledge, skill-strategy mix, training environment and toolsets you need from beginner to pro.<br>As a poker tool, the existing functions have completely covered the calculation and decision-making functions of the whole process and all stages required for scientific training and real-time battles. At least it's completely enough for me.<br><br>There is no longer any free on mobile:<br>1: Before the V4 version, a free google play version was provided for the convenience of steam players to download the mobile version for free, and for some users who were unwilling to pay to experience the function for free. The new version of V4 will be forced to upgrade from the beginning, and the old mobile phone version will not be able to log in. Old users who pay for it need to ask me for it.<br>2: Now I don't offer any free versions on all platforms. Now the computer and mobile phones have the same functions, and the google play also has the same price on steam. But you only need to buy the steam version, then you can send me a letter to ask for the corresponding android mobile version.<br>When asking for the android version, you need to provide a screenshot of your purchase history on the steam platform to prove it. Just send me a screenshot of the purchase record information in the email.<br>3: All versions are unified as paid versions, and the price is the same, which ensures the rights and interests of paying players and the quality level of players.<br>4: On February 26, 2022, the new version of the server was updated to Alibaba Cloud, with 4 cores of 8G, 10M dedicated bandwidth, 80G cloud disk, and a 3-year lease, so the service for at least the next three years is guaranteed.<br><br>If you are a streamer and have some fans, you are willing to play it, and willing to share and show this game to your fans, I am willing to provide you with some steam keys.<br>Send me a letter with your platform and number of followers<br><br>hits:<br>In the battle mode, the range of each player is also shown to you graphically, and the player's hole cards are in the corresponding range. In the pc version, you can select a large resolution in the setting function, so that you can see the range map well in the game.<br><br>And the most important thing is that it's the cheapest of its kind.<br><br>manual：<br><a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=https:\/\/media.st.dl.pinyuncloud.com\/steam\/apps\/1213420\/manuals\/Solo_king.pdf?t=1632806218\" target=\"_blank\" rel=\"noopener\"  >https:\/\/media.st.dl.pinyuncloud.com\/steam\/apps\/1213420\/manuals\/Solo_king.pdf?t=1632806218<\/a><br><br>We welcome capable agent wholesalers from all over the world to sell the software, I provide retail steam keys in all regions of the world<br>100~500 steam keys, 30% off<br>500~1000 steam keys, 40% off<br>1000~2000 steam keys, 50% off<br>The larger the wholesale quantity, the better the discount<br><span class=\"bb_removedlink\" data-community-tooltip=\"The URL that was linked here has been removed by our filters.  Usually this is done to prevent phishing and malware attacks.\">{LINK REMOVED}<\/span><a href=\"#\" class=\"collapsed_link\" style=\"display: none;\">https:\/\/item.taobao.com\/item.htm?id=659491046628<\/a><br><br>core function:<br>1: Click the function  board card  to set the community card, and click the hole card icon to set the hole card.<br>2: Different player types can be set, and each player has a different range of actions. These ranges also determine different action logics.<br>3: Equity calculator, draw equity calculator, EV calculator, real-time poker simulator tool.<br>4: Real-time poker simulator tool, this is the most important for online professional players, which greatly simplifies the time consumption of thinking and performing calculations.<br>5: Advisor (advisor) provides you with a standard play, the basic guarantee is not to lose money.<br>6: Before the action decision, provide the EV value of different actions and betsize.<br>7: Practice the advisor and action EV in the battle mode.<br><br>Core value points:<br>1: Poker simulator tool: When playing poker online, professional players can display the complete mathematical data immediately after entering the opponent's range in real time according to the situation of the game table, saving users calculation time and energy, and providing standardized behavior suggestions. These real-time and accurate calculation data and standardized action suggestions help players make quick decisions.<br><br>Value point: It saves the player's energy consumption in mathematical calculations in the game, and allows the player to invest more energy to focus on the accurate determination of the player's playing range and the use of real-time data to make decisions based on experience.<br>Real-time display of all poker game data, which is not available in other tools. I combined the various data calculation functions scattered in multiple Texas poker calculation software into the real game. The player only needs to determine the opponent's range.<br><br>In the simulator, Preflop and postflop are also purchased professional range action data, which can be set in the simulator: stacks deep, bet size, and player position to see the real-time advisor. Now this advisor is conservative.<br>range data comes from <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=http:\/\/rangeconverter.com\/solution_formats\/eight_max-MTT-Complete-Postflop-Addon-NEWOnlineViewer-yearly\" target=\"_blank\" rel=\"noopener\"  >rangeconverter.com\/solution_formats\/eight_max-MTT-Complete-Postflop-Addon-NEWOnlineViewer-yearly<\/a><br><br>The core of the simulator is that you need to have the ability to judge the opponent's range of action. This is also one of the most basic and most important abilities of playing cards.<br>If you don’t have the ability to display the range of Texas Hold'em at all, then you can use this tool to repeatedly play poker to familiarize yourself with the range. In the battle mode I provide the ability to display the range in real time. Let you clearly see how different people in different ranges play, and those actions are standard textbook play styles for professional players.<br><br>Real-time display of complete data: The data standard provided comes from the result of 10,000 times Equity calculated by Monte Carlo method. In the battle mode with AI, you need to turn on the observer mode switch (observer)<br>Data in the avatar frame:<br>1): EV: 0.70BB, indicating the EV data after the current operation. BB stands for the big blind value.<br>2): equity data for each street:<br>2r: 4; 12.93%. Format: 2r (to river equity, calculated to river street Equity): rank (in the current surviving players, own 2r Equity ranked); equity (own real-time 2r Equity, 2r Equity calculated from your own perspective). Indicates that the Equity data to River Street is calculated based on the player's own hole cards against other players' range or hole cards.<br>nd: 1; 72.67%. Format: nd (next street equity, your own Equity on the next street): rank (ranked your own nd Equity among the current surviving players); equity (your own real-time nd Equity, nd Equity calculated from your own perspective). Indicates that the nd Equity data to the next street is calculated according to the player's own hole cards against other players' range or hole cards.<br>cp: 1; 88.23%. cp (current street pure equity, the pure Equity of one's current street): rank (ranked of one's own cp Equity among the current surviving players); equity (your own real-time cp Equity, cp Equity calculated from your own perspective). Represents the calculated cp Equity data on the current street based on the player's own hole cards against other players' range or hole cards.<br>Outs: 30, which indicates the number of draws made by players on that street. At this time, you can open the hands card strength information table, and you can see the probability of the current hole cards and board cards developing to various draws on each street.<br><br>1: In preflop and river street, showing 2r is enough.<br>2: On flop, turn street: displays the complete 2r, nd, cp data, and on flop, turn street, you can see the outs data of the player in that street at the same time.<br>These real-time Equitys and draw data assist in determining the hole cards against other players' hole cards or ranges, their own hands card strength and winning ability, and help them make action decisions on various streets.<br><br>The betsize window at the top of the interface shows the human player (self) under the current action menu, the EV value ranking of each action in the action menu, the leftmost is the best, and it decreases from left to right (if there is only the leftmost data, then it is According to EV evaluation, this action is the most appropriate, and other actions do not need to be considered). This is based on the action logic shown by the EV. This is also the EV data of each action calculated by the player himself before the action. (The EV data in the avatar range is the EV data after the action, and the meaning of the two is different).<br>This 4-speed EV table of betsize is the data display for making decisions based on EV when displaying the street.<br>In fact, EV has no absolute correct meaning in action guidance before and after the flop (preflop and postflop), and it is not correct to make decisions based on the positive and negative EV.<br><br>Advisor (Advisor): Shows the decision in this street, comprehensively assessing the following content: player's hole cards, opponents' range or hole cards, current own 2r, nd, cp Equity data and Equity ranked, and the player's own position Table position, player's current stacks deep, current number of people remaining at the table, EV data of each action in the current menu, and bankroll management. The current advisors tend to be conservative, and the goal is to try not to lose money.<br>Advisor also implements a standardized pre-flop strategy in preflop.<br>Advisor also implemented the post-flop strategy suggested by <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=http:\/\/rangeconverter.com\" target=\"_blank\" rel=\"noopener\"  >rangeconverter.com<\/a> in postflop.<br>In the battle against AI mode, you need to turn on the advisor mode switch (observer).<br><br>Click on the user's avatar to open the user's scope, view or set the scope.<br>Click on the hole cards, you can open to view or set the hole cards.<br>Click on the board card, you can open to view or set the board card.<br><br>In the simulator, click the D icon to switch the position of the dealer.<br>Click the gray D icon to reset the position of the dealer.<br><br>Regarding range setting or selection:<br>1: Provides the standard range for various filling actions in the preflop stage.<br>2: Provide 24 kinds of action ranges commonly used by professional players. Each professional player divides all hole card combinations into 10 action groups. You can see the action ranges of tag, lag, rock, maniac, and nit players.<br>3: Provides a view of the opponent's mathematical action range based on the opponent's vpip and pfr. Vpip and pfr can view these two values ​​of opponents from third-party statistical software licensed online, such as holdem manager 2.<br><br>The graphical Equity calculator provides a complete and correct Equity calculation function.<br>I provide complete toflop, toturn, toriver's montecarlo and Enum calculation methods. It has the same effect as Power-Equilab, and its own data is guaranteed to be correct.<br>When Power-Equilab calculates toflop and toturn, the data is often incorrect (why it is not, you will know by playing with his montecarlo and Enum methods, the longer the calculation, the greater the deviation of the two data, which is wrong), But the calculation result of to river is correct. It sells for $40\/year. It does not have a real-time calculation method in the game. It is not suitable for actual combat, but only for review calculations, lacking actual combat significance.<br><br>PokerGenius: This provides draw data, and my draw ability calculation is the same as his. This one is from the University of Alberta in Canada, which is also one of the two most famous schools in the world that studies AI in Texas, and the other is cmu.<br>It also provides equity calculations, but only with toriver capabilities. Moreover, neither the draw calculation nor the Equity calculation has the ability of real-time calculation in actual combat. You can only manually enter the calculation to see the result in the review.<br>It sells for $70.<br><br>The provided Equity calculator, draw calculator, and EV calculator are all to ensure that you know the correctness of the data calculation results and allow you to trust the correctness and stability of the function.<br><br>The AI ​​in the battle mode comes from the range of 24 professional players. You can conduct targeted range confrontation strategy training.<br>1): Various AIs and advisors use the same standard professional gameplay action logic. The difference from yours is only the hole cards and the action range.<br>2): 14 types of chip depths (10BB~100BB, 200BB) are provided (different medals will open different new chip depths, and different chip depths will have different playing methods). Because of the different chip depths, the card game will be played The strategy is completely different.<br>3): AI adopts the textbook style of professional players. You can understand the AI's action logic in thousands of matches, you can learn this action logic, and you can also find the corresponding exploiting AI logic. Repeated training can help you quickly identify the opponent's ability and the opponent's range.<br><br>The functions of this V4 version basically cover the core functions in Snowie. As for the effect, you just need to compare it. I can only tell you the value for money. Ability matching is equivalent to Snowie 230 USD\/year.<br><br><br>If it is in Steam, there is no sound.<br>0: under \\Steam\\steamapps\\common\\Solo King-Single Player Texas Holdem Poker\\Windows_Release, rename Windows_Release to Windows_Release1<br>1: Adjust your computer sound controller.<br>2: You can download the game from D:\\Steam\\steamapps\\common\\Solo King-Single Player Texas Holdem Poker\\Windows_Release<br>Move another folder, and then click TexasHoldEmSingle.exe to have sound.","about_the_game":"The game consists of two parts:<br>1: In the console game section, you can play tournament games and heads-up games against professional-level AI opponents.<br>2: A complete set of Texas Hold'em calculation tools<br>The table below shows the functional price comparison between the computing tools in the game and other Texas-related computing products on the market.<br><img src=\"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/extras\/en.png?t=1646034589\" \/><br><br>Help players solve two problems:<br>1: Have a complete tool chain: You have purchased a complete set of Texas Hold'em calculation-related tools at a very cheap price, and it calculates correctly and runs stably. It is cheap, comprehensive, and convenient. One account can share data on multiple platforms, and the functions are consistent, and there is no castration.<br>2: Learn the playing strategies of professional poker players: You only play games with professional-level AI and learn the playing strategies of professional poker players. There is no random behavior to confuse you with entertaining AI, and I don't want to waste your time.<br><br>Satisfy player pursuit and advancement:<br>1: When players play Texas Hold'em, they just want to find and master a set of playing strategies that suit their profession. The professional AI I wrote is written in accordance with the standard textbook-style playing strategies of professional poker players, and they are all in standard poker scenarios. fixed action paradigm,<br>It is very fixed, not random, which helps you quickly understand the playing strategies of professional players. to learn this strategy. Your discovery and learning of patterns will not be interfered with by random strategies.<br><br>Don't think it's going to be silly, it plays a lot better than most players in online real money games. You can buy it on steam to try its AI capabilities, if you are not satisfied, you will get an unconditional refund within 2 hours, you have nothing to lose at all.<br><br>This AI uses standard and mature textbook play to fight against you. You can learn the AI's play, understand the AI's play, and find your own way of defeating the AI. It all depends on your own understanding and ability.<br><br>The AI ​​is not responsible for providing you with the thrill of victory, it is up to you to win. The more games you play in the world of online real money gaming, the more severely you feel you are bound, you feel right, you are almost all playing with a group of professional players who rely on a full suite of scientific tools to give real-time calculations and decision-making cues playing. It was people who were heavily armed like me.<br>In fact, the AI ​​strategy in this game basically covers all my action strategy logic. I wrote it to greatly reduce the energy consumption of my decision-making in the poker game.<br><br>The strategies in this game are extremely effective at PokerStars blind levels below $10\/$20. Further up, I don't want to play games with too much stake, so I can't stand up effectively, so I don't level up.<br><br>2): You have learned strategies, and you need a complete set of tools to assist you. Without scientific calculation tools, in real money poker games, you have strategies and dare not use them. The essence of Texas Hold'em is a real mathematical probability game. Data and calculations determine the choice of strategies.<br><br>In the past two years, the Texas Hold'em books handwritten by foreign professional players who have been translated by the player groups on Taobao are very expensive, far more expensive than my game. Those books cost hundreds of yuan, and they are still very popular.<br>This marks that although the state strictly prohibits Texas games, players' pursuit of strategic knowledge has not stopped. They provided some foreign poker experience and strategies, and I provided a professional training ground and toolset that also filled the gaps for the Chinese in terms of Texas science tools.<br><br>3): Optics does not practice, it is natural to learn, and it is valuable to apply what you have learned. You don’t know whether you are cheating or not, and you don’t know why you win or lose. Basically, you are just playing for nothing.<br><br>In this game, you can freely organize the table, freely set the blind level, freely set the hand range of each opponent, freely set the opponent's AI type, and freely set your own hand range, so that every time the card is dealt, the You're dealt hands in this range, and you're also free to set one of the 20 good hands, so there's a definite training.<br>In the game, the various win rate data, listening win rate, and EV data of each player on each street are calculated in real time, saving you the trouble of manual calculation, and also giving you AI decision-making suggestions from professional-level textbooks. These ensure that you can train fully on demand. and judging whether it makes sense for you.<br>The complete display of this information in the game also helps you analyze the game, so that you know the logic of your winning and losing, where you win and where you lose.<br>Don't think that you lost, it was me who cheated, you can understand whether I cheated by reading the data and graphs carefully, you can't understand these, either you have no knowledge of technology and playing cards, or your understanding is too poor, what? It's all clear, you still can't understand it, and it's clear that you don't have the ability to think, and you can't play IQ games, so don't waste time torturing yourself.<br><br>Tell you clearly:<br>1: I sell strategies and tools, and I show you professional strategies in the game.<br>2: The game is sold at a fixed price. Even if you lose all the chips and diamonds, the server will continue to supply chips and diamonds for you to play. There will be no extra charge. I don't need to cheat you for chips and diamonds at all. , I don't even bother with it.<br>3: The chips and diamonds provided are enough for you to play 50000 hands. You need about 500 hours to play them all. For the vast majority of players, they will not spend 500 hours on a certain game. They do not give you a huge amount. The chips and diamonds are also to bring you closer to the real world to play from small stacks, so that it makes sense.<br>4: It is not a multiplayer online crowd gambling game, but a console game, or more precisely, a training tool. The networking function ensures that you can freely share usage data between your mobile phone and computer.<br><br>This game is more precisely a training tool and a tool for assisting actual combat calculation and strategy. I have provided you with a trainer aircraft and a fighter jet, and it is up to you to combine your wisdom, ability and financial resources to control and use it to assist you.<br>If you think you want to train yourself and experience the brutality of professional gambling, then you can play hard.<br><br>It provides you with the basic prerequisite knowledge, skill-strategy mix, training environment and toolsets you need from beginner to pro.<br>As a poker tool, the existing functions have completely covered the calculation and decision-making functions of the whole process and all stages required for scientific training and real-time battles. At least it's completely enough for me.<br><br>There is no longer any free on mobile:<br>1: Before the V4 version, a free google play version was provided for the convenience of steam players to download the mobile version for free, and for some users who were unwilling to pay to experience the function for free. The new version of V4 will be forced to upgrade from the beginning, and the old mobile phone version will not be able to log in. Old users who pay for it need to ask me for it.<br>2: Now I don't offer any free versions on all platforms. Now the computer and mobile phones have the same functions, and the google play also has the same price on steam. But you only need to buy the steam version, then you can send me a letter to ask for the corresponding android mobile version.<br>When asking for the android version, you need to provide a screenshot of your purchase history on the steam platform to prove it. Just send me a screenshot of the purchase record information in the email.<br>3: All versions are unified as paid versions, and the price is the same, which ensures the rights and interests of paying players and the quality level of players.<br>4: On February 26, 2022, the new version of the server was updated to Alibaba Cloud, with 4 cores of 8G, 10M dedicated bandwidth, 80G cloud disk, and a 3-year lease, so the service for at least the next three years is guaranteed.<br><br>If you are a streamer and have some fans, you are willing to play it, and willing to share and show this game to your fans, I am willing to provide you with some steam keys.<br>Send me a letter with your platform and number of followers<br><br>hits:<br>In the battle mode, the range of each player is also shown to you graphically, and the player's hole cards are in the corresponding range. In the pc version, you can select a large resolution in the setting function, so that you can see the range map well in the game.<br><br>And the most important thing is that it's the cheapest of its kind.<br><br>manual：<br><a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=https:\/\/media.st.dl.pinyuncloud.com\/steam\/apps\/1213420\/manuals\/Solo_king.pdf?t=1632806218\" target=\"_blank\" rel=\"noopener\"  >https:\/\/media.st.dl.pinyuncloud.com\/steam\/apps\/1213420\/manuals\/Solo_king.pdf?t=1632806218<\/a><br><br>We welcome capable agent wholesalers from all over the world to sell the software, I provide retail steam keys in all regions of the world<br>100~500 steam keys, 30% off<br>500~1000 steam keys, 40% off<br>1000~2000 steam keys, 50% off<br>The larger the wholesale quantity, the better the discount<br><span class=\"bb_removedlink\" data-community-tooltip=\"The URL that was linked here has been removed by our filters.  Usually this is done to prevent phishing and malware attacks.\">{LINK REMOVED}<\/span><a href=\"#\" class=\"collapsed_link\" style=\"display: none;\">https:\/\/item.taobao.com\/item.htm?id=659491046628<\/a><br><br>core function:<br>1: Click the function  board card  to set the community card, and click the hole card icon to set the hole card.<br>2: Different player types can be set, and each player has a different range of actions. These ranges also determine different action logics.<br>3: Equity calculator, draw equity calculator, EV calculator, real-time poker simulator tool.<br>4: Real-time poker simulator tool, this is the most important for online professional players, which greatly simplifies the time consumption of thinking and performing calculations.<br>5: Advisor (advisor) provides you with a standard play, the basic guarantee is not to lose money.<br>6: Before the action decision, provide the EV value of different actions and betsize.<br>7: Practice the advisor and action EV in the battle mode.<br><br>Core value points:<br>1: Poker simulator tool: When playing poker online, professional players can display the complete mathematical data immediately after entering the opponent's range in real time according to the situation of the game table, saving users calculation time and energy, and providing standardized behavior suggestions. These real-time and accurate calculation data and standardized action suggestions help players make quick decisions.<br><br>Value point: It saves the player's energy consumption in mathematical calculations in the game, and allows the player to invest more energy to focus on the accurate determination of the player's playing range and the use of real-time data to make decisions based on experience.<br>Real-time display of all poker game data, which is not available in other tools. I combined the various data calculation functions scattered in multiple Texas poker calculation software into the real game. The player only needs to determine the opponent's range.<br><br>In the simulator, Preflop and postflop are also purchased professional range action data, which can be set in the simulator: stacks deep, bet size, and player position to see the real-time advisor. Now this advisor is conservative.<br>range data comes from <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=http:\/\/rangeconverter.com\/solution_formats\/eight_max-MTT-Complete-Postflop-Addon-NEWOnlineViewer-yearly\" target=\"_blank\" rel=\"noopener\"  >rangeconverter.com\/solution_formats\/eight_max-MTT-Complete-Postflop-Addon-NEWOnlineViewer-yearly<\/a><br><br>The core of the simulator is that you need to have the ability to judge the opponent's range of action. This is also one of the most basic and most important abilities of playing cards.<br>If you don’t have the ability to display the range of Texas Hold'em at all, then you can use this tool to repeatedly play poker to familiarize yourself with the range. In the battle mode I provide the ability to display the range in real time. Let you clearly see how different people in different ranges play, and those actions are standard textbook play styles for professional players.<br><br>Real-time display of complete data: The data standard provided comes from the result of 10,000 times Equity calculated by Monte Carlo method. In the battle mode with AI, you need to turn on the observer mode switch (observer)<br>Data in the avatar frame:<br>1): EV: 0.70BB, indicating the EV data after the current operation. BB stands for the big blind value.<br>2): equity data for each street:<br>2r: 4; 12.93%. Format: 2r (to river equity, calculated to river street Equity): rank (in the current surviving players, own 2r Equity ranked); equity (own real-time 2r Equity, 2r Equity calculated from your own perspective). Indicates that the Equity data to River Street is calculated based on the player's own hole cards against other players' range or hole cards.<br>nd: 1; 72.67%. Format: nd (next street equity, your own Equity on the next street): rank (ranked your own nd Equity among the current surviving players); equity (your own real-time nd Equity, nd Equity calculated from your own perspective). Indicates that the nd Equity data to the next street is calculated according to the player's own hole cards against other players' range or hole cards.<br>cp: 1; 88.23%. cp (current street pure equity, the pure Equity of one's current street): rank (ranked of one's own cp Equity among the current surviving players); equity (your own real-time cp Equity, cp Equity calculated from your own perspective). Represents the calculated cp Equity data on the current street based on the player's own hole cards against other players' range or hole cards.<br>Outs: 30, which indicates the number of draws made by players on that street. At this time, you can open the hands card strength information table, and you can see the probability of the current hole cards and board cards developing to various draws on each street.<br><br>1: In preflop and river street, showing 2r is enough.<br>2: On flop, turn street: displays the complete 2r, nd, cp data, and on flop, turn street, you can see the outs data of the player in that street at the same time.<br>These real-time Equitys and draw data assist in determining the hole cards against other players' hole cards or ranges, their own hands card strength and winning ability, and help them make action decisions on various streets.<br><br>The betsize window at the top of the interface shows the human player (self) under the current action menu, the EV value ranking of each action in the action menu, the leftmost is the best, and it decreases from left to right (if there is only the leftmost data, then it is According to EV evaluation, this action is the most appropriate, and other actions do not need to be considered). This is based on the action logic shown by the EV. This is also the EV data of each action calculated by the player himself before the action. (The EV data in the avatar range is the EV data after the action, and the meaning of the two is different).<br>This 4-speed EV table of betsize is the data display for making decisions based on EV when displaying the street.<br>In fact, EV has no absolute correct meaning in action guidance before and after the flop (preflop and postflop), and it is not correct to make decisions based on the positive and negative EV.<br><br>Advisor (Advisor): Shows the decision in this street, comprehensively assessing the following content: player's hole cards, opponents' range or hole cards, current own 2r, nd, cp Equity data and Equity ranked, and the player's own position Table position, player's current stacks deep, current number of people remaining at the table, EV data of each action in the current menu, and bankroll management. The current advisors tend to be conservative, and the goal is to try not to lose money.<br>Advisor also implements a standardized pre-flop strategy in preflop.<br>Advisor also implemented the post-flop strategy suggested by <a href=\"https:\/\/steamcommunity.com\/linkfilter\/?url=http:\/\/rangeconverter.com\" target=\"_blank\" rel=\"noopener\"  >rangeconverter.com<\/a> in postflop.<br>In the battle against AI mode, you need to turn on the advisor mode switch (observer).<br><br>Click on the user's avatar to open the user's scope, view or set the scope.<br>Click on the hole cards, you can open to view or set the hole cards.<br>Click on the board card, you can open to view or set the board card.<br><br>In the simulator, click the D icon to switch the position of the dealer.<br>Click the gray D icon to reset the position of the dealer.<br><br>Regarding range setting or selection:<br>1: Provides the standard range for various filling actions in the preflop stage.<br>2: Provide 24 kinds of action ranges commonly used by professional players. Each professional player divides all hole card combinations into 10 action groups. You can see the action ranges of tag, lag, rock, maniac, and nit players.<br>3: Provides a view of the opponent's mathematical action range based on the opponent's vpip and pfr. Vpip and pfr can view these two values ​​of opponents from third-party statistical software licensed online, such as holdem manager 2.<br><br>The graphical Equity calculator provides a complete and correct Equity calculation function.<br>I provide complete toflop, toturn, toriver's montecarlo and Enum calculation methods. It has the same effect as Power-Equilab, and its own data is guaranteed to be correct.<br>When Power-Equilab calculates toflop and toturn, the data is often incorrect (why it is not, you will know by playing with his montecarlo and Enum methods, the longer the calculation, the greater the deviation of the two data, which is wrong), But the calculation result of to river is correct. It sells for $40\/year. It does not have a real-time calculation method in the game. It is not suitable for actual combat, but only for review calculations, lacking actual combat significance.<br><br>PokerGenius: This provides draw data, and my draw ability calculation is the same as his. This one is from the University of Alberta in Canada, which is also one of the two most famous schools in the world that studies AI in Texas, and the other is cmu.<br>It also provides equity calculations, but only with toriver capabilities. Moreover, neither the draw calculation nor the Equity calculation has the ability of real-time calculation in actual combat. You can only manually enter the calculation to see the result in the review.<br>It sells for $70.<br><br>The provided Equity calculator, draw calculator, and EV calculator are all to ensure that you know the correctness of the data calculation results and allow you to trust the correctness and stability of the function.<br><br>The AI ​​in the battle mode comes from the range of 24 professional players. You can conduct targeted range confrontation strategy training.<br>1): Various AIs and advisors use the same standard professional gameplay action logic. The difference from yours is only the hole cards and the action range.<br>2): 14 types of chip depths (10BB~100BB, 200BB) are provided (different medals will open different new chip depths, and different chip depths will have different playing methods). Because of the different chip depths, the card game will be played The strategy is completely different.<br>3): AI adopts the textbook style of professional players. You can understand the AI's action logic in thousands of matches, you can learn this action logic, and you can also find the corresponding exploiting AI logic. Repeated training can help you quickly identify the opponent's ability and the opponent's range.<br><br>The functions of this V4 version basically cover the core functions in Snowie. As for the effect, you just need to compare it. I can only tell you the value for money. Ability matching is equivalent to Snowie 230 USD\/year.<br><br><br>If it is in Steam, there is no sound.<br>0: under \\Steam\\steamapps\\common\\Solo King-Single Player Texas Holdem Poker\\Windows_Release, rename Windows_Release to Windows_Release1<br>1: Adjust your computer sound controller.<br>2: You can download the game from D:\\Steam\\steamapps\\common\\Solo King-Single Player Texas Holdem Poker\\Windows_Release<br>Move another folder, and then click TexasHoldEmSingle.exe to have sound.","short_description":"SoloKing Poker - AI coaching and training poker software. Poker training complex tools: Poker Hand Evaluator, Showdown Calculator, Table Simulation, Equity Evaluator,Draw Evaluator, EV Evaluator, Advisor Coach. The Strongest Poker AI Opponents. No-Limit ring games, MTTs, heads-up tournaments.","supported_languages":"English<strong>*<\/strong>, French<strong>*<\/strong>, Italian<strong>*<\/strong>, German<strong>*<\/strong>, Spanish - Spain<strong>*<\/strong>, Russian<strong>*<\/strong>, Turkish<strong>*<\/strong>, Japanese<strong>*<\/strong>, Thai<strong>*<\/strong>, Simplified Chinese<strong>*<\/strong>, Traditional Chinese<strong>*<\/strong>, Portuguese - Brazil<strong>*<\/strong>, Vietnamese<strong>*<\/strong>, Arabic<strong>*<\/strong>, Korean<strong>*<\/strong>, Spanish - Latin America<strong>*<\/strong>, Portuguese<strong>*<\/strong><br><strong>*<\/strong>languages with full audio support","header_image":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/header.jpg?t=1646034589","website":null,"pc_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> Windows XP<br><\/li><li><strong>Processor:<\/strong> 2.0 GHz<br><\/li><li><strong>Memory:<\/strong> 512 MB RAM<br><\/li><li><strong>Graphics:<\/strong> 1024x768 monitor resolution<br><\/li><li><strong>Network:<\/strong> Broadband Internet connection<br><\/li><li><strong>Storage:<\/strong> 200 MB available space<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> Windows 7<br><\/li><li><strong>Processor:<\/strong> 2.0 GHz<br><\/li><li><strong>Memory:<\/strong> 1024 MB RAM<br><\/li><li><strong>Graphics:<\/strong> Reasonable<br><\/li><li><strong>Network:<\/strong> Broadband Internet connection<br><\/li><li><strong>Storage:<\/strong> 300 MB available space<\/li><\/ul>"},"mac_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> Mac OSX 10.7+<br><\/li><li><strong>Processor:<\/strong> 2.0 GHz<br><\/li><li><strong>Memory:<\/strong> 512 MB RAM<br><\/li><li><strong>Graphics:<\/strong> Reasonable<br><\/li><li><strong>Network:<\/strong> Broadband Internet connection<br><\/li><li><strong>Storage:<\/strong> 200 MB available space<\/li><\/ul>"},"linux_requirements":[],"developers":["sun xiaodong"],"publishers":["sun xiaodong"],"price_overview":{"currency":"UAH","initial":20900,"final":20900,"discount_percent":0,"initial_formatted":"","final_formatted":"209₴"},"packages":[419759],"package_groups":[{"name":"default","title":"Buy Texas Holdem Poker: Solo King","description":"","selection_text":"Select a purchase option","save_text":"","display_type":0,"is_recurring_subscription":"false","subs":[{"packageid":419759,"percent_savings_text":" ","percent_savings":0,"option_text":"Solo King - Single Player : Texas Hold'em Poker - 209₴","option_description":"","can_get_free_license":"0","is_free_license":false,"price_in_cents_with_discount":20900}]}],"platforms":{"windows":true,"mac":true,"linux":false},"categories":[{"id":2,"description":"Single-player"}],"genres":[{"id":"25","description":"Adventure"},{"id":"4","description":"Casual"},{"id":"23","description":"Indie"},{"id":"28","description":"Simulation"},{"id":"2","description":"Strategy"}],"screenshots":[{"id":0,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_dd36a55296ddcac5b83d10384cc37586faa274f7.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_dd36a55296ddcac5b83d10384cc37586faa274f7.1920x1080.jpg?t=1646034589"},{"id":1,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_35d29cfb6bd31b4dd13372678e8f21e577c0a4a4.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_35d29cfb6bd31b4dd13372678e8f21e577c0a4a4.1920x1080.jpg?t=1646034589"},{"id":2,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_0f4cc5d8a5b7e6cc39d52b4136373569530438a2.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_0f4cc5d8a5b7e6cc39d52b4136373569530438a2.1920x1080.jpg?t=1646034589"},{"id":3,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_13521f343493921afcbdcd86d71e30be26df6c82.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_13521f343493921afcbdcd86d71e30be26df6c82.1920x1080.jpg?t=1646034589"},{"id":4,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_5ba1d8ddcffcfac6cf189d10ab900455c696526c.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_5ba1d8ddcffcfac6cf189d10ab900455c696526c.1920x1080.jpg?t=1646034589"},{"id":5,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_dfda18a2da04348f9a8667d835a8aea9307fed7f.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_dfda18a2da04348f9a8667d835a8aea9307fed7f.1920x1080.jpg?t=1646034589"},{"id":6,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_bad7118049604e559ff303702a9a8bee43e284e0.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_bad7118049604e559ff303702a9a8bee43e284e0.1920x1080.jpg?t=1646034589"},{"id":7,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_0d6ea72026f5f96061e196cc8f4fd61d7099ea59.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_0d6ea72026f5f96061e196cc8f4fd61d7099ea59.1920x1080.jpg?t=1646034589"},{"id":8,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_e5ac048aee06e32205feaa9141c543a8d2105c2f.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_e5ac048aee06e32205feaa9141c543a8d2105c2f.1920x1080.jpg?t=1646034589"},{"id":9,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_47d8463628314953e8723ba9234143f063f67029.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_47d8463628314953e8723ba9234143f063f67029.1920x1080.jpg?t=1646034589"},{"id":10,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_57b39eb080510a975e90b2e0ccb2546c0f323329.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_57b39eb080510a975e90b2e0ccb2546c0f323329.1920x1080.jpg?t=1646034589"},{"id":11,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_351056fdcf7d029827b7b5f3c50b90077927ece8.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_351056fdcf7d029827b7b5f3c50b90077927ece8.1920x1080.jpg?t=1646034589"},{"id":12,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_453b9799894a3485ccf4faa8e30dd8ce56655813.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_453b9799894a3485ccf4faa8e30dd8ce56655813.1920x1080.jpg?t=1646034589"},{"id":13,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_ed3f3eddabeabb0d0656a1b2c7775b28da0ca0e6.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_ed3f3eddabeabb0d0656a1b2c7775b28da0ca0e6.1920x1080.jpg?t=1646034589"},{"id":14,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_850b2c09e26637317a0fcb8b295aa08e22b5b03e.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_850b2c09e26637317a0fcb8b295aa08e22b5b03e.1920x1080.jpg?t=1646034589"},{"id":15,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_a8223c6b174b8919e299bd30144c9e22fcc96a46.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_a8223c6b174b8919e299bd30144c9e22fcc96a46.1920x1080.jpg?t=1646034589"},{"id":16,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_6e13869b5c782b3de4e294bba3d6c53a2d99a4fa.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_6e13869b5c782b3de4e294bba3d6c53a2d99a4fa.1920x1080.jpg?t=1646034589"},{"id":17,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_72f22b3095cd66aa8bd2251d48ec49ceb49e0738.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_72f22b3095cd66aa8bd2251d48ec49ceb49e0738.1920x1080.jpg?t=1646034589"},{"id":18,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_aca418ca05dc914647126bcca47cdd00f6d63c57.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_aca418ca05dc914647126bcca47cdd00f6d63c57.1920x1080.jpg?t=1646034589"},{"id":19,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_e2004b8ddc1ea62383386036559c23c26cced5b3.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_e2004b8ddc1ea62383386036559c23c26cced5b3.1920x1080.jpg?t=1646034589"},{"id":20,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_0834080abf71198b7d74de694f0902a048b864af.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_0834080abf71198b7d74de694f0902a048b864af.1920x1080.jpg?t=1646034589"},{"id":21,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_b21fc666e9606cd65737b05e8bcde82bf9b8a346.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_b21fc666e9606cd65737b05e8bcde82bf9b8a346.1920x1080.jpg?t=1646034589"},{"id":22,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_677faa657d8817ea13ea5ce25c847f7f63881461.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_677faa657d8817ea13ea5ce25c847f7f63881461.1920x1080.jpg?t=1646034589"},{"id":23,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_7a886865b10e628cf08393ff3f70c7e4164d2e84.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_7a886865b10e628cf08393ff3f70c7e4164d2e84.1920x1080.jpg?t=1646034589"},{"id":24,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_f13caeef75711f5d4ab6faa6cfbc9167398c4cbe.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_f13caeef75711f5d4ab6faa6cfbc9167398c4cbe.1920x1080.jpg?t=1646034589"},{"id":25,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_96ca1995511cc43edb01394f596847c1ab5e9e21.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_96ca1995511cc43edb01394f596847c1ab5e9e21.1920x1080.jpg?t=1646034589"},{"id":26,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_99da8df49401600181e74ee6643ccd83b90e343e.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_99da8df49401600181e74ee6643ccd83b90e343e.1920x1080.jpg?t=1646034589"},{"id":27,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_f795170e51ead8ba929d7fd6069fbb7d3e17836f.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_f795170e51ead8ba929d7fd6069fbb7d3e17836f.1920x1080.jpg?t=1646034589"},{"id":28,"path_thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_acee8acba49da5d9b69da7cb84440af63b780dd7.600x338.jpg?t=1646034589","path_full":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/ss_acee8acba49da5d9b69da7cb84440af63b780dd7.1920x1080.jpg?t=1646034589"}],"movies":[{"id":256842282,"name":"duizhan","thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842282\/movie.293x165.jpg?t=1625844954","webm":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842282\/movie480_vp9.webm?t=1625844954","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842282\/movie_max_vp9.webm?t=1625844954"},"mp4":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842282\/movie480.mp4?t=1625844954","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842282\/movie_max.mp4?t=1625844954"},"highlight":true},{"id":256842274,"name":"equity","thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842274\/movie.293x165.jpg?t=1625843066","webm":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842274\/movie480_vp9.webm?t=1625843066","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842274\/movie_max_vp9.webm?t=1625843066"},"mp4":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842274\/movie480.mp4?t=1625843066","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842274\/movie_max.mp4?t=1625843066"},"highlight":true},{"id":256842272,"name":"simulation","thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842272\/movie.293x165.jpg?t=1625843074","webm":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842272\/movie480_vp9.webm?t=1625843074","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842272\/movie_max_vp9.webm?t=1625843074"},"mp4":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842272\/movie480.mp4?t=1625843074","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842272\/movie_max.mp4?t=1625843074"},"highlight":true},{"id":256842270,"name":"introduction1","thumbnail":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842270\/movie.293x165.jpg?t=1625843083","webm":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842270\/movie480_vp9.webm?t=1625843083","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842270\/movie_max_vp9.webm?t=1625843083"},"mp4":{"480":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842270\/movie480.mp4?t=1625843083","max":"http:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/256842270\/movie_max.mp4?t=1625843083"},"highlight":true}],"release_date":{"coming_soon":false,"date":"4 Mar, 2020"},"support_info":{"url":"http:\/\/www.soyohui.cn\/","email":"1938982123@qq.com"},"background":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/page_bg_generated_v6b.jpg?t=1646034589","background_raw":"https:\/\/cdn.akamai.steamstatic.com\/steam\/apps\/1213420\/page_bg_generated.jpg?t=1646034589","content_descriptors":{"ids":[],"notes":null}}}}